/*
 * Copyright (c) 2021-2022 Huawei Device Co., Ltd.
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "character_transliterate.h"

#include <codecvt>
#include <iostream>

#include "common.h"
#include "hilog_wrapper.h"

namespace OHOS {
namespace Contacts {
ChineseTable CharacterTransliterate::chineseTable_[411] = {
    {"a", "a", "吖阿呵啊腌锕錒嗄厑"},
    {"a", "ao",
        "凹柪梎軪熬爊敖厫隞蔜遨廒嗷嗸獓"
        "嶅滶獒摮璈磝螯聱翱翶謷謸鳌翺嚣"
        "鏖鷔鰲鼇艹夭芺抝拗袄镺媪媼襖岙"
        "岰垇坳傲奡奥奧骜嫯慠懊墺澳嶴擙"
        "鏊驁澚鱜"},
    {"a", "ang", "肮骯卬仰岇昂昻枊盎醠"},
    {"a", "ai",
        "哎哀诶唉娭挨埃溾嗳锿鎄捱皑啀凒"
        "溰敱敳嘊皚癌騃佁毐昹欸娾矮蔼躷"
        "噯濭藹譪霭靄艾阨伌爱砹硋隘嗌嫒"
        "塧碍愛叆暧瑷僾噫壒懓嬡薆鴱餲璦"
        "曖懝皧瞹馤礙譺鑀靉閊魞﨟鱛鱫"},
    {"a", "an",
        "厂广安侒峖桉氨庵偣谙菴萻葊媕腤"
        "痷鹌誝蓭鞍鞌諳盦馣鮟盫鵪鶕韽玵"
        "啽雸儑垵俺唵埯铵晻揞罯銨屵犴岸"
        "按洝荌胺豻案婩隌堓暗貋錌闇黯"},

    {"b", "bai",
        "挀掰白犤百伯佰陌柏栢捭絔摆擺襬"
        "庍呗拝败拜敗猈稗粺薭贁韛瓸竡粨"
        "兡"},
    {"b", "ba",
        "丷八仈巴叭朳玐吧岜扷芭夿疤柭釟"
        "蚆粑笆捌哵羓豝鲃叐茇妭拔炦胈癹"
        "菝軷詙跋颰魃鼥把钯鈀靶伯弝坝爸"
        "杷垻罢耙跁鲅罷鮁覇矲霸壩灞"
        "欛抜鎺鯐"},
    {"b", "ban",
        "扳肦攽班般颁斑斒搬頒鳻瘢螌褩癍"
        "辬阪岅坂板版昄瓪钣粄舨鈑蝂魬闆"
        "办半伴扮拌姅绊坢怑柈秚絆湴鉡靽"
        "辦瓣螁"},
    {"b", "bang",
        "邦帮垹梆捠浜邫幇幚縍幫鞤绑綁榜"
        "牓膀玤挷旁蚌棒棓傍谤蒡搒塝稖蜯"
        "镑磅艕謗鎊"},
    {"b", "bao",
        "勹包苞孢炮枹胞剥剝笣龅煲裦褒蕔"
        "襃闁齙窇雹薄宝饱怉鸨保宲珤葆堡"
        "堢媬寚飽飹褓駂鳵鴇緥賲寳寶靌勽"
        "刨报抱铇豹趵蚫菢袌報鉋鲍骲髱暴"
        "虣鮑曓儤瀑爆犦曝忁鑤佨藵"},
    {"b", "ben",
        "奔泍贲犇锛錛本苯奙畚翉楍夯坌倴"
        "逩桳笨捹渀撪"},
    {"b", "bei",
        "陂卑杯柸背盃桮椑揹悲鹎碑藣鵯北"
        "鉳贝狈孛邶貝牬昁苝备郥钡被倍俻"
        "狽悖梖偝偹鄁珼琲惫軰備僃棓辈焙"
        "蓓蛽碚愂禙犕褙誖鞁骳鋇輩糒憊鞴"
        "鐾唄"},
    {"b", "beng",
        "伻祊奟崩绷閍絣痭嵭嘣綳繃甭甮埄"
        "埲菶琫琣鞛迸泵蚌逬揼塴甏镚蹦鏰"},
    {"b", "bi",
        "皀屄偪逼毴楅榌豍鵖螕鲾鎞鰏荸鼻"
        "匕比朼夶吡妣沘佊疕彼毞柀秕笔粃"
        "舭俾啚筆鄙箄聛貏币必毕闭庇佖诐"
        "芘邲迊坒怭怶苾妼咇泌畀畁哔荜陛"
        "贲毖柲珌疪秘铋毙狴畢袐粊笓閉閇"
        "婢庳萆萞梐敝赑堛愊愎皕禆弼弻湢"
        "詖筚賁貱蜌裨辟跸閟飶鉍滗滭嗶彃"
        "蓖蓽腷睥睤痹痺煏熚碧蔽弊鄪獙幣"
        "綼箅箆馝髲駜襅幤潷罼獘壁廦嬖避"
        "薜篦篳縪觱鮅蹕髀濞斃臂奰鏎饆鄨"
        "璧繴襣襞鞸魓韠躄躃驆鷝鐴贔朇鷩"
        "鼊萙蛯嬶"},
    {"b", "bian",
        "边炞砭笾萹编猵煸牑甂箯蝙糄編鞕"
        "鍽鳊獱邉邊鞭鯿鯾籩贬扁窆匾貶惼"
        "褊稨碥鴘藊卞弁抃汳汴苄釆忭玣变"
        "変昪便覍徧遍缏揙閞辡諚緶艑辨辩"
        "辧辫辮辯變峅"},
    {"b", "biao",
        "杓标飑骉髟彪淲猋脿颮滮摽骠蔈幖"
        "墂麃標熛膘镖瘭磦飙飚儦颷謤藨瀌"
        "爂鏢贆臕穮镳飆飇飈飊鑣驫嫑表婊"
        "裱諘錶褾檦俵鳔鋲"},
    {"b", "bie",
        "憋瘪蟞鳖癟鱉鼈虌龞别別莂蛂徶襒"
        "蹩彆"},
    {"b", "bin",
        "邠玢宾彬梹椕傧斌滨缤賓賔豩槟瑸"
        "镔儐濒頻豳濱濵虨璸檳瀕霦繽蠙鑌"
        "顮摈殡膑髩鬂擯殯臏髌鬓髕鬢"},
    {"b", "bing",
        "冫仌氷并冰兵屏栟掤槟丙邴陃苪怲"
        "抦秉昞昺炳柄饼绠眪蛃偋寎棅鈵禀"
        "稟鉼餅餠鞞幷並併庰倂栤竝病窉傡"
        "摒誁鮩靐垪鞆"},
    {"b", "bo",
        "卜癶癷波拨玻饽钵盋砵哱剥般趵缽"
        "紴袰菠啵溊碆鉢鲅僠蕃嶓播撥餑礡"
        "蹳驋鱍仢伯驳孛肑瓝泊狛帛郣勃侼"
        "胉柏袯瓟秡钹铂浡挬亳萡淿脖袹舶"
        "鹁渤葧博猼馎愽搏鈸鉑鲌魄馛駁艊"
        "箔牔煿膊僰镈踣鋍馞駮鮊薄謈襏簙"
        "餺鵓鎛嚗懪髆髉糪襮欂礴鑮跛簸孹"
        "檗擘譒蘗畓蔔"},
    {"b", "bu",
        "逋庯峬钸晡鈽誧餔錻鳪轐醭卜卟补"
        "哺捕堡補鵏鸔不布吥佈步歨歩怖咘"
        "钚柨悑部勏捗埔埗荹埠瓿鈈蔀廍踄"
        "郶餢篰簿巭"},
    {"c", "ca", "拆擦攃嚓礤礸遪乲"},
    {"c", "cai",
        "偲猜才财材財裁纔毝采倸啋寀婇彩"
        "採埰棌睬跴綵踩宷菜蔡縩"},
    {"c", "can",
        "参參叄骖飡湌叅喰傪嬠餐驂残蚕惭"
        "殘慚蝅慙蠺蠶惨朁慘憯穇篸黪黲"
        "灿掺孱粲薒澯燦璨謲儏爘"},
    {"c", "cang",
        "仓仺伧苍沧鸧舱倉傖凔滄蒼獊嵢"
        "螥艙鶬臧藏鑶賶濸"},
    {"c", "cao",
        "撡操糙曺曹蓸嘈嶆漕慒槽褿螬艚鏪"
        "艸草愺懆騲肏鄵襙鼜"},
    {"c", "ce",
        "测撡操糙曺曹蓸嘈嶆漕慒槽褿螬艚鏪"
        "艸草愺懆騲肏鄵襙鼜"},
    {"c", "cen", "参嵾岑涔埁笒梣"}, {"c", "ceng", "噌层曾層嶒竲驓蹭"},
    {"c", "cha",
        "叉扱扠杈臿差挿偛馇插揷嗏喳锸碴"
        "銟艖疀嚓鍤餷茬茶垞查査秅猹嵖搽"
        "靫詧楂槎察檫衩蹅镲鑔奼汊岔刹侘"
        "诧剎姹咤紁詫"},
    {"c", "chai",
        "芆肞钗拆差釵犲侪柴豺祡喍儕茝虿"
        "訍袃瘥蠆囆"},
    {"c", "chan",
        "辿觇梴掺搀覘裧摻鋓幨襜攙苂单谗"
        "婵馋湹孱棎禅煘缠蝉獑僝誗鋋儃廛"
        "嬋潺潹緾澶磛鄽螹毚蟬瀍酁儳蟾劖"
        "壥嚵瀺巉欃纏纒躔镵艬讒鑱饞产刬"
        "旵丳斺浐剗谄阐铲產産蒇剷摌滻蕆"
        "幝諂閳骣燀簅冁醦繟鏟譂闡囅灛讇"
        "忏硟摲懴颤懺羼韂顫"},
    {"c", "chang",
        "伥昌倡倀菖阊娼猖淐琩锠裮錩閶鲳"
        "鯧鼚长仧仩场兏肠苌镸長尝倘偿萇"
        "徜常瓺場腸甞裳塲嫦嘗膓瑺嚐償鲿"
        "鱨厂昶惝敞厰僘廠氅鋹怅玚畅鬯唱"
        "悵焻暢畼誯韔椙蟐"},
    {"c", "che",
        "车伡車俥砗莗唓硨蛼尺扯偖撦屮彻"
        "迠坼烢聅硩掣頙撤澈徹瞮勶爡"},
    {"c", "chao",
        "吵抄弨怊欩钞绰訬超鈔焯剿窼牊晁"
        "巢巣朝鼌鄛漅潮樔嘲窲罺鼂轈謿炒"
        "眧焣煼麨巐仦仯耖觘"},
    {"c", "chen",
        "抻郴捵棽琛嗔綝賝諃瞋謓尘臣辰忱"
        "沉陈迧茞莀莐宸陳栕桭谌訦軙敐晨"
        "鈂愖煁蔯樄塵敶瘎霃諶螴薼麎曟鷐"
        "趻硶碜墋夦踸磣鍖贂衬疢称龀趁趂"
        "榇齓齔儭谶嚫櫬襯讖烥"},
    {"c", "cheng",
        "阷泟爯柽棦称秤浾琤偁铛碀蛏晿牚"
        "赪靗憆稱摚撑撐噌樘緽頳赬瞠橕檉"
        "竀罉蟶穪鏿鐣饓丞成朾呈郕诚枨承"
        "荿宬娍峸洆城乗乘埕挰珹珵窚掁脭"
        "铖盛程揨堘裎絾筬惩椉棖誠塍塖溗"
        "酲鋮畻澄澂憕橙檙瀓懲騬侱徎逞骋"
        "悜庱睈騁鯎"},
    {"c", "chi",
        "吃妛彨哧胵鸱蚩粚笞眵瓻喫訵絺嗤"
        "媸摛痴瞝殦噄誺螭鴟鵄魑癡齝攡彲"
        "黐弛驰池迟迡茌坻竾荎持匙蚳赿貾"
        "遅筂遟馳箎墀漦遲踟篪鍉謘尺叺伬"
        "呎肔齿侈卶垑胣蚇耻恥豉袳歯欼袲"
        "裭鉹齒褫彳叱斥杘赤饬灻抶侙勅恜"
        "炽勑翅翄敕烾湁啻飭雴傺腟痸鉓銐"
        "翤瘈遫憏瘛慗翨熾趩懘鶒鷘麶"},
    {"c", "chong",
        "冲充沖忡茺涌浺珫翀舂嘃摏憧衝憃"
        "罿艟蹖虫种重隀崇崈漴褈蝩緟蟲爞"
        "宠埫寵铳揰銃"},
    {"c", "chou",
        "抽紬搊篘瘳犨犫仇俦帱栦菗绸惆"
        "絒椆畴愁皗稠筹詶酬酧裯踌綢雔儔"
        "薵懤幬嬦檮燽雠疇籌醻躊讎讐雦丑"
        "丒吜杻杽偢瞅醜矁魗臭臰遚殠鮘"},
    {"c", "chua", "欻"},
    {"c", "chu",
        "出岀初摴樗貙齣刍处助除芻厨蒢豠"
        "滁锄雏鉏趎蒭媰蜍耡犓鋤篨廚橱櫉"
        "幮躇雛蹰櫥鶵躕杵础處椘楮储禇楚"
        "褚濋儲檚礎齭齼亍処竌豖绌怵泏竐"
        "欪畜俶敊埱絀珿傗鄐滀搐触閦諔儊"
        "嘼憷斶黜臅歜觸矗榋璴蟵"},
    {"c", "chuan",
        "巛川氚穿瑏传舡舩船剶遄椽傳暷篅"
        "輲舛荈喘歂僢踳汌玔串钏釧猭賗鶨"},
    {"c", "chuang",
        "刅创疮窓窗牎摐牕瘡窻床牀幢噇闯"
        "傸磢闖怆刱剏剙創愴"},
    {"c", "chuai", "揣搋膗啜嘬膪踹"},
    {"c", "chui",
        "吹炊龡垂埀陲倕桘菙捶搥棰椎圌腄"
        "锤槌箠錘鎚顀"},
    {"c", "chun",
        "旾杶春萅媋堾椿槆暙瑃蝽箺輴橁"
        "櫄鶞鰆纯陙莼唇浱純脣淳湻犉鹑滣"
        "蒓蓴漘醇醕錞鶉鯙偆萶惷睶賰蠢"},
    {"c", "cong",
        "匆苁囱囪忩茐枞怱悤棇葱楤蔥蓯骢"
        "漗聡聪聦熜潨樅樬暰瑽璁瞛蟌聰篵"
        "鍯繱鏦鏓騘驄从丛徔従從徖婃淙悰"
        "孮琮潀漎賨賩誴錝樷藂叢灇欉爜愡"
        "憁謥"},
    {"c", "ci",
        "刺差呲玼疵趀偨跐骴縒髊蠀齹词珁"
        "茈茨垐柌祠兹瓷辝詞辞慈甆鹚磁雌"
        "餈飺糍辤薋嬨濨鴜礠辭鷀鶿此佌泚"
        "皉鮆朿次伺佽刾庛茦栨莿赐蛓絘賜"
        "螆閊"},
    {"c", "chuo",
        "逴趠踔戳繛辶辵哾娖娕婼婥啜涰绰"
        "惙辍酫踀綽輟龊擉餟磭歠嚽齪鑡"},
    {"c", "cu",
        "怚粗觕麁麄橻麤徂殂卒促脨猝酢媨"
        "瘄蔟趗誎醋憱趣踧噈瘯踿縬簇鼀蹙"
        "蹴蹵顣"},
    {"c", "cou", "凑湊辏楱腠輳"},
    {"c", "cun",
        "邨村皴踆澊墫竴膥存侟拵蹲刌忖寸"
        "籿"},
    {"c", "cuan",
        "汆撺镩蹿攛躥鑹菆攒櫕巑欑穳窜殩"
        "熶篡簒竄爨"},
    {"c", "cui",
        "崔脺嵟凗催缞墔慛榱獕摧槯磪縗鏙"
        "漼璀趡皠伜忰疩脆脃倅粋紣翆萃啐"
        "啛淬悴焠毳琗瘁翠綷粹膵膬竁襊濢"
        "顇臎"},
    {"c", "cuo",
        "搓遳瑳磋撮醝蹉鎈虘嵯嵳睉痤蒫矬"
        "蔖瘥鹾酂鹺脞剉剒莝莡厝挫夎措逪"
        "锉错蓌銼錯"},
    {"d", "da",
        "咑哒耷笚答嗒搭褡撘墶噠鎝鎉打达"
        "迏迖迚怛呾妲沓荙荅炟羍畗畣惮匒"
        "剳逹笪詚達跶靼瘩薘鞑蟽鐽韃龖龘"
        "大亣汏垯眔畓繨躂鶎"},
    {"d", "dang",
        "当珰裆铛筜當儅噹澢璫襠蟷艡簹鐺"
        "闣挡党谠擋譡黨攩灙欓讜氹凼圵宕"
        "砀荡垱档菪婸逿愓瓽雼嵣潒碭瞊趤"
        "蕩壋檔璗盪礑簜蘯"},
    {"d", "dan",
        "丹妉担单単眈砃耽耼郸聃躭酖單殚"
        "媅瘅匰鄲頕褝箪勯儋殫擔甔襌簞聸"
        "刐伔抌瓭玬胆衴紞疸掸赕亶馾撣撢"
        "賧黕膽黮黵旦石帎但诞狚泹沊柦唌"
        "疍蛋弹惮啖啗淡萏啿弾氮蜑腅觛誕"
        "窞蓞僤噉髧嘾彈憚憺禫澹駳鴠餤癉"
        "癚繵贉嚪饏霮"},
    {"d", "dai",
        "呆呔待獃懛歹歺逮傣大代轪甙侢迨"
        "帒骀岱绐垈贷带玳殆柋怠軑貣帯帶"
        "埭蚮紿軚袋軩貸瑇跢廗叇曃蝳緿鴏"
        "黛艜戴簤瀻霴黱襶靆"},
    {"d", "de", "的嘚恴得淂棏惪悳锝徳德鍀地底"},
    {"d", "dao",
        "刀刂叨忉朷氘舠釖鱽魛螩捯导岛陦"
        "島捣倒祷禂搗隝嶋嶌導隯嶹擣壔蹈"
        "禱辺到帱悼焘菿盗盜道翢稲稻噵艔"
        "衜衟檤燾翿軇瓙纛乭﨩椡槝"},
    {"d", "dei", "嘚得"},
    {"d", "deng",
        "灯登豋僜噔嬁燈璒竳簦蹬等戥邓鄧"
        "隥凳嶝澄墱镫瞪磴櫈覴鐙艠"},
    {"d", "den", "扥扽"}, {"d", "dia", "嗲"},
    {"d", "di",
        "氐仾低彽奃岻秪袛隄羝埞啲堤提趆"
        "滴嘀镝磾鞮廸狄苖迪的籴唙荻涤敌"
        "梑啇笛靮觌滌髢馰頔翟嫡蔋蔐樀敵"
        "藡嚁豴蹢鏑覿糴鸐厎邸阺诋坘坻弤"
        "底呧抵拞柢牴砥掋菧軧觝詆骶聜鯳"
        "地坔杕旳弟玓苐枤怟埅帝俤娣递逓"
        "埊焍谛梊祶菂偙眱珶第釱睇揥媂蒂"
        "棣缔楴禘遞僀腣鉪碲蝃摕遰蔕墬墑"
        "甋蝭締慸諦踶嶳螮嚸"},
    {"d", "die",
        "爹跌褺苵迭咥峌挕绖垤恎昳胅瓞眣"
        "耊谍眰戜絰臷镻詄趃跕畳喋耋惵堞"
        "揲殜叠楪牃牒跮碟褋蜨嵽蝶艓諜蹀"
        "鴩疂螲鲽蹛曡疉鰈疊氎哋幉"},
    {"d", "diao",
        "刁叼汈刟虭凋彫奝弴蛁貂琱鳭碉鮉"
        "瞗錭鲷雕簓鼦鯛鵰鸟扚屌弔吊伄钓"
        "盄窎訋调铞铫掉釣鈟竨蓧銱銚雿魡"
        "調窵瘹鋽藋鑃"},
    {"d", "dian",
        "敁掂厧傎嵮滇槇槙瘨颠蹎顛顚巅癫"
        "巓攧巔癲齻典奌点婰敟碘蒧蕇踮點"
        "电甸阽佃店坫垫扂玷钿惦婝淀琔奠"
        "殿鈿蜔電墊壂澱橂靛磹癜簟驔椣"},
    {"d", "diu", "丢丟铥颩銩"},
    {"d", "ding",
        "丁仃帄叮玎钉盯疔町虰耵酊釘靪艼"
        "奵顶頂鼎鼑嵿濎薡鐤订饤忊矴定訂"
        "飣铤萣啶椗腚锭碇碠錠顁磸"},
    {"d", "du",
        "厾剢都阇督嘟醏闍独毒读渎牍椟犊"
        "裻読錖獨凟匵嬻瀆殰犢櫝牘瓄皾騳"
        "黩髑韣讀贕豄鑟韇韥黷讟肚笃堵赌"
        "琽睹賭覩篤芏杜妒妬度荰秺靯渡镀"
        "螙鍍殬斁蠧蠹叾獤"},
    {"d", "dou",
        "吺剅都唗兜兠蔸橷篼唞斗阧抖枓钭"
        "陡蚪鈄吋豆郖读荳逗饾浢鬥渎酘毭"
        "梪脰痘閗窦鬦餖斣闘竇鬪鬬鬭乧"},
    {"d", "dong",
        "东冬東咚苳岽昸氡鸫倲菄崬崠涷埬"
        "娻笗氭蝀鮗鼕鯟鶇董蕫嬞懂箽諌动"
        "冻侗垌恫栋胨迵姛峒挏洞凍胴戙動"
        "硐湩腖棟働駧霘鶫"},
    {"d", "dui",
        "垖堆塠痽磓鴭鐜鐓頧队对兊兌対兑"
        "祋怼陮隊敦碓綐對憞憝錞镦薱濧懟"
        "瀩譈譵轛"},
    {"d", "duan",
        "耑偳媏端褍鍴短段断葮缎塅煅瑖腶"
        "椴锻碫緞毈簖鍛斷躖籪"},
    {"d", "duo",
        "多夛咄哆剟掇毲敠敪裰嚉夺度铎敚"
        "敓剫喥痥奪凙澤踱鐸驮朵朶杕饳剁"
        "沲哚挆柮柂垛垜埵缍舵崜惰媠椯躲"
        "躱趓跺綞亸鬌軃嚲奲刴陊陏挅尮桗"
        "堕跥飿墮憜墯鵽﨣鈬鯲"},
    {"d", "dun",
        "吨惇敦蜳撴墩墪噸撉犜镦礅蹲蹾驐"
        "盹趸躉伅庉沌囤炖逇钝盾砘顿鈍遁"
        "頓楯遯潡燉踲碷壿"},
    {"e", "e",
        "阿妸妿娿婀屙讹迗吪囮俄峉峨峩涐"
        "恶娥莪哦珴訛鈋皒锇睋鹅蛾誐磀噁"
        "鋨頟魤额額鵝鵞譌厄阸苊呃扼轭枙"
        "垩砨饿胺阏鄂谔萼遌遏崿愕頋腭锷"
        "鹗頞餩噩鳄騀戹岋呝砐砈咹咢姶匎"
        "蚅軛硆悪卾偔堊堨堮湂惡軶豟鈪琧"
        "廅搤搹僫蝁蕚遻餓颚閼擜諤覨鍔顎"
        "歞礘櫮鶚鰐鰪齃讍齶鑩鱷仒厑蛯旕"
        "鵈襨欕"},
    {"e", "en", "奀恩蒽煾峎摁"}, {"e", "ei", "欸誒"}, {"e", "eng", "鞥椧"},
    {"e", "er",
        "乻儿而児陑侕荋耏峏洏栭胹唲鸸袻"
        "聏輀鲕髵隭鴯鮞臑轜尔尒尓耳迩饵"
        "洱毦栮珥铒鉺餌爾駬薾邇二弍弐佴"
        "刵咡贰貮貳衈誀髶樲粫趰"},
    {"f", "fa",
        "发冹沷発發酦彂乏伐姂坺垡茷阀疺"
        "罚栰笩筏傠瞂罰閥罸墢橃藅佱法峜"
        "砝灋珐琺髪髮蕟浌鍅"},
    {"f", "fang",
        "匚方邡芳汸坊枋牥钫蚄淓趽鈁錺鴋"
        "防妨房肪鲂魴访仿彷纺昉昘瓬眆紡"
        "舫旊倣訪髣鶭放堏"},
    {"f", "fan",
        "帆忛畨番勫蕃幡噃嬏憣旙旛繙翻藩"
        "轓颿飜籓鱕凡凣凢匥杋柉钒矾籵舤"
        "舧袢烦笲釩棥煩緐墦樊璠膰薠燔襎"
        "繁羳蹯鐇礬蘩瀿蠜鷭反払仮返橎"
        "犯氾汎奿饭泛贩范畈軓訉販笵盕梵"
        "軬飯飰滼嬎範輽瀪"},
    {"f", "feng",
        "丰风凨仹凬妦沣凮枫盽疯砜封風峰"
        "峯偑桻烽堼葑崶渢猦锋犎楓蜂碸瘋"
        "篈僼鄷鋒檒豐鎽鏠酆蘴寷灃蠭靊飌"
        "麷冯夆沨浲逢溄堸馮艂漨缝摓綘縫"
        "讽覂唪諷凤奉俸湗焨煈赗鳯鳳鴌賵"
        "琒"},
    {"f", "fen",
        "分芬帉吩纷氛昐玢衯紛翂躮訜酚棻"
        "梤鈖雰馚餴朆饙妢岎汾坟炃朌枌羒"
        "蚠蚡焚棼蒶隫魵蕡幩獖墳濆燌燓橨"
        "豮鼢羵鼖豶轒鐼馩黂粉黺份弅坋忿"
        "奋秎偾粪愤僨憤膹奮糞鲼瀵鱝竕瞓"},
    {"f", "fei",
        "飞妃非飛菲啡婓婔渄绯扉猆暃靟"
        "裶蜚緋鲱霏馡餥騑騛鯡飝肥淝腓蜰"
        "朏胐匪诽奜悱棐斐翡榧蕜誹篚发芾"
        "吠狒沸怫杮废肺胇昲费厞剕陫俷疿"
        "萉屝廃費痱镄廢曊癈鼣蟦濷櫠鐨靅"},
    {"f", "fou", "紑缶否妚缻缹雬殕鴀"}, {"f", "fo", "仏佛坲梻"},
    {"f", "fu",
        "夫伕邞孚呋妋姇玞肤胕砆衭怤柎荂荴"
        "尃娐旉麸趺紨跗鈇稃綒筟鄜孵粰膚鳺"
        "麩敷麬糐麱懯乀巿弗凫伏甶佛刜芾芙"
        "芣扶拂泭岪绂绋咈帗苻茀枎怫服韨氟"
        "祓玸枹柫炥畐畉罘茯郛鳬俘垘洑浮哹"
        "莩蚨袚栿砩翇桴烰琈袱虙艴紱紼符笰"
        "菔匐涪幅葍絥罦棴鳧艀鉘鉜颫辐福蜉"
        "綍箙稪榑韍豧髴鴔蝠幞澓輻踾鮄諨黻"
        "襆癁鮲襥鵩鶝阝父甫抚拊弣府斧郙俛"
        "俌俯釜釡捬脯辅腑盙焤蜅滏腐輔頫嘸"
        "撫鬴簠鯱黼讣付妇负附彿咐驸坿竎阜"
        "訃負赴复祔峊袝蚥蚹副婦婏冨偩傅復"
        "萯媍富赋蛗秿覄詂鲋腹椱缚赙複褔蝮"
        "蝜緮蕧賦駙鮒輹嬔縛賻鳆鍑鍢馥覆鰒"
        "酜﨓椨禣"},

    {"g", "ga",
        "夹旮伽呷咖嘎嘠轧钆釓尜噶錷玍尕尬"
        "魀乫凩軈"},
    {"g", "gai",
        "侅该陔郂荄姟峐垓赅晐祴畡絯隑賅賌"
        "豥該忋改絠丐乢匃匄芥钙盖鈣摡溉葢"
        "蓋戤概槩漑槪瓂"},
    {"g", "gang",
        "冈冮刚扛纲岗杠肛疘矼牨岡钢缸"
        "罡剛堈掆釭犅棡摃堽罁綱鋼鎠崗港焵"
        "焹筻槓戆戅戇"},
    {"g", "gan",
        "干甘迀奸忓杆攼玕肝姏泔苷坩矸竿柑"
        "酐疳粓凲尴尲筸鳱漧尶尷魐仠芉皯衦"
        "秆赶笴桿敢稈感澉趕橄澸擀簳鳡鱤汵"
        "旰盰绀凎倝淦紺詌骭幹榦檊贑赣贛灨"},
    {"g", "gao",
        "羔皋高羙髙皐臯膏睾槔槹橰糕篙餻韟"
        "櫜鼛鷎鷱夰杲菒稁搞缟槁槀暠稿稾镐"
        "縞藁藳檺鎬告郜勂诰峼祮祰锆筶誥禞"
        "鋯吿"},
    {"g", "gei", "给給"},
    {"g", "ge",
        "戈仡犵扢纥圪戓肐牫疙饹咯哥胳格鸽"
        "袼搁割滒歌戨鴚鴿謌擱鎶呄匌佮茖阁"
        "挌革鬲敋葛隔裓蛤蛒臵愅觡嗝滆塥搿"
        "槅膈閤閣鞈骼韐镉獦諽輵鮯鎘韚騔鞷"
        "轕个合各哿盖舸嗰虼個铬硌箇鉻乬巪"
        "叾唟彁櫊"},
    {"g", "geng",
        "更刯庚畊耕浭菮赓焿絚鹒縆緪賡羮鶊"
        "羹郠莄哽峺挭绠埂耿颈梗綆鲠骾鯁堩"
        "暅椩"},
    {"g", "gen", "根跟哏艮亘亙茛揯搄"},
    {"g", "gu",
        "估杚姑沽泒孤苽咕呱轱柧骨鸪罛唂唃"
        "家菰菇蛄笟軱軲觚辜酤蓇鈲毂稒箍箛"
        "篐嫴橭鴣鮕鹘夃古诂汩谷股苦牯羖贾"
        "钴罟蛊啒淈愲尳詁鹄馉鈷榾嗀鼓鼔榖"
        "嘏皷穀縎糓薣濲臌皼餶轂盬瞽瀔鶻蠱"
        "固故顾凅牿梏崮崓堌棝雇祻锢痼僱錮"
        "鲴鯝顧逧脵傦"},
    {"g", "gou",
        "勾句沟佝枸钩痀袧鈎缑鉤溝褠緱篝簼"
        "鞲韝芶苟狗岣耇耉玽蚼笱耈豿诟坸购"
        "构姤垢冓够夠啂訽詬雊遘彀媾搆煹觏"
        "構撀購覯"},
    {"g", "gong",
        "工弓公厷功共红杛攻供侊肱糼糿宫"
        "宮恭蚣躬龚匑幊愩塨觥躳慐匔碽髸觵"
        "龏龔廾巩汞拱栱拲珙輁鞏贡唝貢嗊"
        "熕赣"},
    {"g", "guai", "乖摑叏拐柺枴罫箉夬怪恠"},
    {"g", "gua",
        "瓜刮呱胍栝桰鸹歄煱趏劀緺踻颳鴰騧"
        "冎叧剐剮寡卦诖坬挂掛啩罣絓詿褂颪"},
    {"g", "guan",
        "关观纶官冠矜覌倌莞蒄棺窤関瘝癏観"
        "闗鳏關鰥鱞觀馆琯筦痯管輨錧館璭舘"
        "鳤卝毌丱串贯泴掼涫惯悺貫悹祼慣潅"
        "摜遦樌盥罆雚躀鏆灌瓘爟矔鹳礶罐鑵"
        "鸛鱹欟"},
    {"g", "gui",
        "归圭妫龟邽规茥闺皈胿珪帰亀硅袿規"
        "廆椝媯郌瑰摫閨鲑嫢嬀槻槼龜璝瞡鮭"
        "歸雟鬶嶲騩瓌鬹蘬宄氿轨庋匦陒佹诡"
        "姽垝恑攱癸軌鬼祪庪匭晷湀蛫觤詭厬"
        "簋蟡攰昋刿刽炅炔柜贵桂桧椢猤筀貴"
        "跪蓕瞆螝撌劌劊槶樻檜禬瞶癐襘櫃鐀"
        "鳜鞼鑎鱖鱥櫷"},
    {"g", "guang",
        "光灮炗炚炛茪咣姯洸垙烡桄珖胱輄"
        "僙銧黆广広犷廣獷臩俇逛臦"},
    {"g", "gun",
        "丨衮袞绲惃辊棍蓘滚滾蔉緄緷輥鲧磙"
        "鮌鯀睔謴"},
    {"g", "guo",
        "过呙咶涡埚郭堝啯猓崞锅楇聒鈛瘑墎"
        "濄蝈彉嘓鍋彍蟈懖囯国囶囻圀國帼掴"
        "腘漍聝幗蔮慖虢膕馘簂果菓馃淉惈褁"
        "椁槨蜾粿綶裹輠餜過腂鐹"},
    {"h", "han",
        "犴佄顸哻蚶酣頇谽嫨憨馠魽鼾邗汗邯"
        "含函凾虷唅娢浛圅焓梒晗琀涵崡嵅寒"
        "韩甝筨蜬鋡澏韓罕浫喊蔊豃厈"
        "汉屽扞闬旱垾悍猂莟捍涆菡焊晘釬閈"
        "皔睅蛿傼馯感颔漢撖蜭熯銲鋎暵頷憾"
        "螒翰撼顄駻雗譀瀚鶾兯爳"},
    {"h", "hai",
        "咍咳嗨还孩骸海胲烸酼醢亥妎骇害氦"
        "餀嗐駭駴饚塰"},
    {"h", "ha", "呵哈紦铪鉿虾蛤奤乤扖溌噺鎺鱩"},
    {"h", "hao",
        "茠蒿薅薧嚆乚毜皋蚝毫椃嗥獆貉豪獔"
        "噑嘷獋儫濠壕嚎蠔籇譹好郝号昊昦侴"
        "秏悎耗哠浩恏晧淏傐皓鄗聕號滈暤暭"
        "皞皜澔镐薃皡曍皥颢顥鰝灏灝竓"},
    {"h", "hang",
        "夯炕行苀迒吭斻杭肮绗桁珩蚢航笐颃"
        "貥裄絎筕頏魧沆巷垳"},
    {"h", "hen", "拫痕鞎佷很哏狠詪恨"}, {"h", "hei", "黒黑嗨嘿潶"},
    {"h", "he",
        "诃呵抲欱牙合訶喝嗬蠚禾纥何和咊郃"
        "劾姀河盇柇狢峆饸阂曷籺紇釛荷核敆"
        "盍盉害涸渮盒菏萂啝龁訸颌惒楁澕毼"
        "阖鲄詥貉貈鉌閡餄麧熆鹖頜魺螛翮篕"
        "餲鞨齕闔礉覈鶡皬鑉龢吓佫贺垎哬袔"
        "寉焃鹄猲賀碋嗃煂熇褐赫鹤翯癋謞壑"
        "嚇燺爀鶴鶮鸖靍粭遤靎靏"},
    {"h", "hong",
        "叿吽呍灴轰哄訇烘軣焢硡揈渹谾薨輷"
        "鍧嚝轟仜弘妅屸红纮玒汯吰闳宏宖苰"
        "泓玜垬沗虹紅洪娂荭羾翃浤紘耾竑鸿"
        "硔紭谹鈜閎粠竤渱葓葒綋谼翝鉷鞃魟"
        "潂鋐篊黉霐彋蕻霟鴻黌唝晎讧訌閧銾"
        "撔澒闂鬨闀"},
    {"h", "heng",
        "亨哼涥悙脝行恒恆姮珩胻烆桁鸻撗横"
        "橫衡鴴蘅鑅鵆啈"},
    {"h", "hu",
        "乎匢戏虍芴苸呼泘垀昒忽曶恗烀轷匫"
        "唿惚淴虖軤雽雐滹嘑寣幠糊歑膴謼抇"
        "囫狐弧和瓳胡核壶隺壷斛焀鹄絗壺猢"
        "搰湖喖葫媩煳楜瑚鹘鹕蔛嘝蝴箶槲魱"
        "衚頶醐螜縠鍸餬觳鵠鬍瀫鶘鶦鰗乕汻"
        "虎浒俿萀唬虝琥滸錿互弖户戶戸冱芐"
        "护沪沍帍戽岵怙枑昈祜怘笏瓠扈婟楛"
        "雇綔嗀嗀鄠嫭嫮蔰滬摢槴熩鳸鍙豰簄"
        "嚛鹱護鳠頀鸌鱯粐"},
    {"h", "hua",
        "化华花哗砉錵蘤划呚骅姡華铧釫釪猾"
        "滑嘩搳撶劃磆鲑螖鋘蕐譁鏵驊鷨夻话"
        "杹枠画桦崋婳畫畵嬅觟話摦樺槬澅嫿"
        "諙諣黊舙繣譮婲埖椛硴蒊糀誮"},
    {"h", "huan",
        "欢犿狟歓鴅鵍酄嚾孉獾懽歡讙貛驩还"
        "郇环荁峘洹桓萑萈寏堚雈絙綄貆獂羦"
        "锾圜澴缳寰嬛還阛鍰環豲镮鹮糫繯轘"
        "鐶闤鬟瓛缓睆緩幻肒奂奐宦唤换涣浣"
        "眩烉焕梙逭患嵈喛喚渙換愌痪豢瑍煥"
        "瘓漶鲩槵澣擐藧鯇攌鯶鰀"},
    {"h", "huai",
        "怀徊淮槐褢踝褱懐懷瀤櫰耲蘹坏壊壞"
        "蘾"},
    {"h", "hou",
        "齁侯矦鄇葔帿喉猴睺瘊銗篌骺糇翭翵"
        "鍭餱鯸吼犼后郈厚茩後逅洉垕候堠豞"
        "鲎鲘鮜鱟"},
    {"h", "hun",
        "昏昬荤阍婚涽惛殙棔葷睧睯蔒閽轋忶"
        "浑珲混馄渾魂琿餛鼲诨俒圂溷慁倱婫"
        "掍焝睴觨尡諢"},
    {"h", "huang",
        "巟肓荒衁宺朚塃慌皇隍凰偟黄黃葟徨"
        "遑喤媓崲揘湟堭惶煌楻瑝锽墴潢獚熿"
        "蝗璜艎篁諻穔癀磺蟥簧餭鳇鍠韹趪騜"
        "鐄鰉鱑鷬怳恍炾晃晄谎奛幌詤熀縨謊"
        "兤櫎滉愰榥曂皝鎤皩"},
    {"h", "huo",
        "吙秴耠锪劐嚄豁騞攉佸和活秮秳灬火"
        "邩伙钬鈥煷漷夥沎货或咟俰获捇眓閄"
        "貨掝祸喐剨湱禍惑旤蒦窢鍃霍濩獲奯"
        "擭檴雘謋穫镬矆彟瀖嚯藿蠖耯艧嚿曤"
        "臛矐癨鑊韄靃彠"},
    {"h", "hui",
        "戏灰灳炜诙咴挥拻洃恢袆虺珲烣晖豗"
        "堕婎媈揮隓辉翚暉禈睢煇楎詼睳褘幑"
        "噅噕撝翬輝麾徽隳瀈蘳鰴囘回囬佪廻"
        "廽茴迴恛洄蚘烠逥痐蛔蛕蜖鮰虫悔毁"
        "毀毇燬檓譭卉屶屷汇讳会泋浍绘哕诲"
        "荟芔贿烩桧恚恵晦彗秽絵翙廆惠喙缋"
        "阓湏滙匯會彚彙賄詯誨瘣僡嘒蔧蕙"
        "潓寭圚憓槥暳慧橞諱嬒獩濊薈薉徻頮"
        "餯藱篲檅燴璯繢穢瞺蟪嚖懳繪翽譓櫘"
        "鏸儶闠靧鐬譿顪颒璤"},
    {"j", "ji",
        "几讥叽击刉饥圾机刏乩芨玑肌鸡矶奇"
        "其枅咭唧剞姬屐积畟笄飢基庴喞嵇嵆"
        "幾赍犄筓缉朞稘畸嗘跻鳮銈僟綨緁箕"
        "毄稽鹡觭躸諆緝畿嘰槣齑錤機禨墼激"
        "隮襀積璣磯羁賷簊擊櫅耭雞韲鶏譏譤"
        "鐖饑躋鷄鞿魕癪羇虀鑇鑙齏覉羈鸄覊"
        "亼亽及伋彶吉汲岌级忣极即亟郆佶卽"
        "姞叝急皍級笈革觙揤疾堲楖焏偮卙谻"
        "集殛戢棘極湒塉嵴楫辑愱蒺嫉蝍趌銡"
        "耤膌槉嶯潗濈蕺蕀瘠箿踑踖輯螏檝藉"
        "磼襋蹐鍓艥籍鏶霵轚鶺齎躤雧己丮妀"
        "犱纪泲虮济给挤脊掎鱾戟麂魢撠橶穖"
        "擠蟣彑计旡记伎齐系忌坖际芰妓技剂"
        "季迹垍既紀荠茤茍洎哜計記剤紒觊继"
        "绩悸梞旣祭偈徛寄寂済葪蔇惎臮跡鬾"
        "魝裚痵継蓟際兾勣漈漃禝穊稩暨魥鲚"
        "霁跽誋諅鲫暩稷穄曁冀劑薊髻覬薺嚌"
        "濟檕績罽繋璾檵蹟鵋鯽齌鯚懻癠穧骥"
        "蘎蘮瀱繼鱀鰶鰿鷑霽蘻鱭驥﨤樭撃鯲"
        "廭"},
    {"j", "jiang",
        "江茳将姜浆畕豇將葁畺摪翞僵螀漿薑"
        "缰壃殭橿螿鳉礓疅疆繮韁鱂讲奖桨蒋"
        "傋塂奨奬蔣槳獎膙耩講顜匞匠弜夅降"
        "洚绛弶强絳酱勥滰嵹摾犟糡醤醬糨謽"
        "櫤"},
    {"j", "jie",
        "节阶疖皆结階接掲秸痎街揭嗟喈喼媘"
        "嫅堦椄湝脻楷煯稭鞂蝔擑謯癤鶛卩卪"
        "孑尐讦刧劫岊刦杢昅杰疌衱劼刼诘狤"
        "洁拮迼桔桀訐莭倢偈偼菨婕崨捷掶袺"
        "蛣絜結媫傑颉鉣嵥搩滐節睫詰蜐楬楶"
        "榤截鲒碣竭蓵潔镼鞊頡誱踕羯幯嶻擮"
        "鮚礍鍻巀蠞蠘蠽毑姐媎解觧飷檞丯介"
        "价芥岕庎吤戒届屆玠疥砎界畍衸诫借"
        "蚧悈徣唶堺楐琾骱蛶誡犗褯魪鎅藉桝"},
    {"j", "jiao",
        "艽交郊茭茮骄娇姣峧浇胶教焦椒蛟"
        "跤虠鲛僬蕉澆憍嶕嶣嬌膠膲徼鮫穚鹪"
        "礁鵁簥轇蟭鐎驕鷦鷮矫嚼臫角侥佼狡"
        "饺挢绞烄晈捁笅皎脚铰搅湫絞筊賋勦"
        "剿腳敫煍暞僥摷踋鉸餃撟撹儌徺劋敽"
        "缴憿敿矯曒璬蟜皦繳譑孂灚攪鱎龣叫"
        "呌挍峤觉訆珓校轿较敎窌窖較滘漖嘄"
        "嘂嘦斠酵嶠噍潐嬓獥噭藠轎醮趭譥皭"
        "釂"},
    {"j", "jian",
        "戋尖幵奸间歼坚浅戔冿玪肩艰姦姧兼"
        "监笺豜菅菺猏惤渐堅缄溅湔葌間雃犍"
        "牋瑊椷椾睷碊蒹搛缣煎蔪箋鲣緘鹣樫"
        "蕑蕳熞鳽熸縑鋻餰馢鞬艱鞯鳒瀐鵑鵳"
        "殱礛瀸鰔鰜鶼殲櫼譼韀礷鰹囏虃韉鑯"
        "暕囝枧拣俭茧柬笕倹捡挸湕帴减剪检"
        "梘趼詃検锏睑硷裥堿減揃揀谫弿瑐絸"
        "筧简戬戩碱儉翦篯撿藆襇襉檢謇蹇謭"
        "簡繭礆瞼鬋鹸鰎蠒鐧鐗瀽鹻譾籛襺鹼"
        "见件見建饯贱洊荐剑牮珔舰剣健俴涧"
        "栫剱谏徤袸毽臶腱践跈寋楗旔賎鉴键"
        "監槛榗漸僭劎劍澗箭糋諓賤踺踐趝餞"
        "諫鍵薦劒劔鍳瞷磵礀繝濺檻擶瀳譛鏩"
        "覵覸艦轞鐱鑑鑒鑬鑳豣彅墹麉"},
    {"j", "jia",
        "加夹夾伽抸拁泇佳茄迦珈浃毠枷浹家"
        "痂耞笳袈梜葭傢跏猳腵筴鉫犌嘉镓豭"
        "貑鴐鎵麚甲扴圿忦郏郟荚莢唊恝脥铗"
        "戛戞裌蛱颊蛺跲頬鋏頰鴶鵊岬叚玾胛"
        "钾贾斚假婽徦斝椵賈鉀槚榎嘏瘕檟价"
        "驾架嫁幏榢價駕稼嗧糘"},
    {"j", "jiu",
        "丩勼纠朻牞鸠究糺糾赳阄萛啾揪揂湫"
        "鳩揫摎樛鬏鬮九久乆乣氿汣奺灸玖舏"
        "韭紤镹酒韮匛旧臼疚咎柩柾桕倃匓厩"
        "救就廄廐舅廏僦慦殧舊鹫鯦麔匶齨鷲"
        "杦欍"},
    {"j", "ju",
        "车凥且抅拘泃匊狙岨苴驹居陱毩捄挶"
        "眗疽砠罝梮蛆掬据涺崌娵婮毱趄跔跙"
        "椐琚腒锔裾雎蜛艍躹諊踘鋦駒鴡鮈鞠"
        "檋鞫鶋局泦侷狊桔郹焗菊啹婅淗湨椈"
        "輂犑閰跼粷趜橘駶鵙繘鵴蹫鶪鼰巈"
        "蘜鼳驧弆咀沮柜枸举莒矩挙椇筥龃榉"
        "榘蒟聥舉踽擧櫸齟欅襷籧巨句讵苣邭"
        "姖岠拒洰怇炬歫拠具昛秬钜剧俱倨倶"
        "袓蚷耟粔詎距埧埾惧犋鉅飓虡豦锯窭"
        "寠聚愳駏鮔踞屦劇勮遽據澽懅窶壉鋸"
        "颶屨貗簴醵躆鐻懼﨔"},
    {"j", "jiong",
        "冂冋坰扃埛駉駫蘏蘔囧冏迥泂炅炯逈"
        "侰浻烱絅颎煚窘綗僒煛熲褧澃顈燛"},
    {"j", "jing",
        "巠坕坙泾茎京径经亰荆荊秔涇婛猄惊"
        "旌旍菁経稉葏晶腈睛經粳精綡聙兢"
        "鲸麖鶄鶁鯨鼱驚麠井丼阱刭宑汫坓汬"
        "肼穽剄殌景儆頚幜澋憬璄璟璥憼暻頸"
        "蟼警劲妌迳弪净浄俓婙胫莖弳逕倞徑"
        "凈竞痉竟竫淨桱梷婧脛靓敬竧痙傹靖"
        "静獍誩踁境靚靜镜曔瀞鵛鏡競竸橸"},
    {"j", "jin",
        "巾今仐斤钅金釒觔矜衿荕津珒紟矝琎"
        "惍釿堻筋禁璡黅鹶襟仅尽卺侭巹紧堇"
        "菫厪谨僅锦嫤馑漌蓳廑緊槿瑾儘錦謹"
        "饉伒劤妗劲进近枃浕勁荩浸赆烬晋晉"
        "祲進唫煡缙溍寖搢靳盡墐瑨歏殣凚僸"
        "觐縉賮噤濅濜嚍藎嬧燼璶覲贐齽兓砛"
        "琻壗"},
    {"j", "jun",
        "军君汮均龟袀軍姰钧莙蚐桾菌皲鈞碅"
        "筠覠銞皸皹銁鲪頵麇鍕鮶麏麕呁郡陖"
        "俊骏峻馂捃浚埈隽焌晙珺葰竣畯棞雋"
        "蜠箘箟賐儁寯懏餕燇駿濬鵔鵕鵘攈攟"},
    {"j", "juan",
        "姢娟捐涓圈焆朘鹃裐勬镌鋑鎸鐫蠲呟"
        "卷帣埍菤捲锩踡錈臇奆劵巻狷勌倦桊"
        "绢悁隽眷鄄淃瓹腃睊罥絭絹睠慻蔨餋"
        "獧羂讂"},
    {"j", "jue",
        "噘撅撧屩屫亅孓孒决刔诀氒角芵弡決"
        "抉泬玦玨珏觉疦砄虳绝挗捔倔蚗欮脚"
        "桷斍覐觖訣赽掘崛崫趹鈌焳傕厥趉覚"
        "絶絕阙劂谲瑴駃鴃鴂瘚爴觮獗噊蕨蕝"
        "熦憰嶡嶥噱憠橛橜镢臄爵櫭蟩蟨譎爑"
        "蹶蹻蹷鐍鐝矍鳜嚼匷覺觼爝灍戄攫玃"
        "彏鷢矡貜躩钁"},

    {"k", "ka",
        "咖咔喀卡佧咯胩鉲凧垰桛裃閊綛聢鯑"
        "鶍"},
    {"k", "kai",
        "开奒開揩锎鐦凯剀闿恺垲铠慨剴蒈凱"
        "嘅嵦愷楷塏輆锴暟鍇鎧闓颽忾炌烗欬"
        "勓愾鎎"},
    {"k", "ken", "肎肯肻垦恳啃豤貇錹墾懇掯硍裉褃"},
    {"k", "kao",
        "尻嵪髛丂考攷拷洘烤栲铐熇犒銬鲓靠"
        "鮳鯌廤"},
    {"k", "kan",
        "刊看栞龛勘嵁堪戡龕凵冚坎侃砍莰偘"
        "惂欿歁槛輡顑轗竷衎崁墈阚磡瞰闞"
        "鬫矙"},
    {"k", "ke",
        "匼苛坷呵牱牁珂科轲柯钶疴砢趷蚵痾"
        "軻颏棵萪稞犐搕鈳窠颗薖榼樖頦瞌蝌"
        "磕顆髁醘礚壳咳殻殼翗揢可岢炣渇渴"
        "敤嵑嶱克刻勀勊客峇恪娔课骒氪堁衉"
        "愘缂溘愙锞嗑碦緙艐課錁騍礊厼迲硛"
        "嵙兡穒鯑"},
    {"k", "kang",
        "忼砊粇康閌嫝嵻漮慷槺穅糠躿鏮鱇扛"
        "亢匟邟伉闶犺抗囥炕钪鈧"},
    {"k", "kua", "夸咵姱誇侉垮銙挎胯趶跨骻舿"},
    {"k", "ku",
        "刳郀矻枯桍哭堀圐跍窟骷鮬苦狜楛库"
        "绔俈秙庫焅袴裤絝喾瘔酷褲嚳萙鶎"},
    {"k", "kou",
        "芤抠眍剾摳彄瞘口劶叩扣怐敂宼冦寇"
        "釦窛筘蔻蔲滱瞉簆鷇"},
    {"k", "kong", "空倥崆涳埪悾硿箜躻錓鵼孔恐控鞚"}, {"k", "keng", "阬劥吭妔坑挳硁牼铿硜硻誙摼銵鍞鏗"},
    {"k", "kuan", "宽寛寬臗髋髖梡欵款歀窽窾鑧"},
    {"k", "kuai",
        "蒯擓巜凷会块快侩郐浍哙狯脍欳塊"
        "筷鲙墤鄶儈廥澮獪噲膾糩旝鱠圦"},
    {"k", "kui",
        "亏岿刲悝盔窥聧窺虧顝闚巋奎晆隗鄈"
        "逵馗揆葵喹骙暌戣楏楑魁睽蝰頯鍨鍷"
        "櫆藈騤夔蘷虁巙犪躨傀煃跬頍磈蹞"
        "归尯匮蒉喟媿馈溃愦愧匱蕢嬇嘳憒潰"
        "聩聭篑謉殨膭餽簣聵籄饋"},
    {"k", "kuang",
        "匡邼劻诓哐洭恇匩硄筐筺軭誆狂狅抂"
        "忹诳軖軠誑鵟夼儣懭邝纩圹况旷岲況"
        "矿昿贶眖砿框絋眶絖貺軦鉱鋛鄺壙黋"
        "爌曠懬穬矌礦纊鑛"},
    {"k", "kun",
        "坤昆晜裈堃菎猑崑崐焜琨髠髡锟鹍裩"
        "褌蜫髨醌瑻熴錕鲲騉鵾鯤鶤捆悃阃壸"
        "梱祵稇硱裍綑稛壼閫閸困涃睏堒潉"},
    {"k", "kuo",
        "扩拡括挄栝蛞筈萿葀阔廓頢髺韕鞟闊"
        "擴濶霩鞹鬠"},
    {"l", "lan",
        "兰岚拦栏惏婪嵐阑葻蓝谰澜褴斓儖篮"
        "镧闌藍襕懢燷燣璼襤幱譋繿籃蘭蘫瀾"
        "灆攔欄斕襴灡囒籣讕躝欗襽鑭韊览浨"
        "揽缆榄漤罱醂覧壈懒擥懶嬾孄覽孏攬"
        "爦欖顲纜烂滥燗濫嚂爁爛瓓灠爤糷钄"},
    {"l", "la",
        "拉垃柆菈啦喇搚邋旯剌砬揦磖嚹藞翋"
        "落腊楋揧蜡蝋辣辢瘌蝲臈癞鬎臘攋爉"
        "瓎櫴镴鯻蠟鑞凩溂鞡鮱"},
    {"l", "lai",
        "来俫莱徕崃涞梾铼來倈郲徠逨庲唻婡"
        "猍崍淶萊赉棶琜睐筙赖箂錸濑癞騋麳"
        "鶆鯠籁襰睞賫賚賴頼顂鵣藾瀨瀬癩籟"
        "萙"},
    {"l", "lang",
        "啷勆郎郞郎欴莨狼桹蓈廊嫏琅斏稂锒"
        "硠瑯榔蜋艆筤郒躴螂樃鋃鎯朗朖烺蓢"
        "塱誏朤阆崀浪埌蒗閬"},
    {"l", "lao",
        "捞撈劳労牢窂涝浶唠哰崂勞铹痨僗嶗"
        "潦憥癆磱蟧簩醪鐒顟髝耂老佬荖咾姥"
        "狫恅栳珯铑銠獠轑络烙閖落嗠酪耢嫪"
        "嘮澇憦躼橯耮軂硓粩朥"},
    {"l", "leng", "棱唥塄楞稜碐薐冷倰堎愣睖踜"},
    {"l", "le",
        "肋嘞仂阞忇艻叻扐氻乐玏泐竻砳勒楽"
        "餎韷樂簕鳓鰳鱳朰榁"},
    {"l", "li",
        "哩刕丽厘骊剓荲狸离梨梸犁琍悡菞喱"
        "犂棃鹂缡蜊艃筣漓蓠剺嫠孷樆璃盠貍"
        "鋫鲡黎褵犛蔾縭篱罹錅謧醨蟍釐離藜"
        "嚟邌斄瓈鏫鵹鯬蟸黧蠡蠫灕囄蘺孋廲"
        "劙鑗籬穲纚驪鱺鸝礼礼里李俚峛峢峲"
        "逦娌理锂裡裏裏豊鋰鲤澧禮鯉醴鳢邐"
        "鱧鱱欚力历厉屴立朸吏呖励利叓苈坜"
        "沥沴岦枥苙例戾疠隶疬砅赲俪俐荔茘"
        "郦栎栃轹猁悧珕栗栛涖浰莉莅娳砺砾"
        "秝鬲蛎蚸粝粒笠婯唳脷悷棙傈凓厤跞"
        "詈蛠痢雳鳨睙鉝厯蒞蒚搮溧塛慄暦歴"
        "瑮厲綟蜧蝷篥鴗隷勵歷曆巁濿檪隸鬁"
        "磿癘犡爄蠇櫔曞禲擽儮嚦攊藶瓅櫟瀝"
        "壢礪麗礫蠣爏糲盭櫪瓑皪酈儷癧礰麜"
        "鷅轢觻躒囇攦欐讈轣靂瓥攭靋唎甅睝"
        "粴魞聢竰糎鯏鯐"},
    {"l", "lei",
        "勒累傫雷蔂缧嫘畾樏擂儡縲攂镭礌櫑"
        "瓃羸礧罍纍蘲鐳轠鑘靁虆欙纝鼺厽耒"
        "诔洡垒絫塁誄漯蕌磊磥蕾藟壘癗櫐礨"
        "蠝灅蘽讄儽壨鑸鸓肋泪类涙淚酹銇頛"
        "頪錑檑颣類纇蘱禷矋"},
    {"l", "lia", "俩"},
    {"l", "lian",
        "连奁怜帘涟連莲梿裢联廉慩蓮亷漣溓"
        "嗹匲奩槤熑覝鲢聨聫磏褳憐匳劆噒嫾"
        "濂濓薕螊聮縺翴聯謰蹥燫櫣臁镰鎌簾"
        "蠊瀮鬑鰱鐮籢籨敛琏脸裣摙璉蔹嬚鄻"
        "斂歛臉襝羷蘞蘝练炼恋殓堜僆萰媡湅"
        "链煉楝瑓潋練澰錬鍊殮鏈鰊瀲戀纞"},
    {"l", "liang",
        "良俍莨凉凉梁涼椋辌量粮粱踉墚樑輬"
        "駺糧両两兩俩倆唡啢掚脼裲蜽緉魉魎"
        "亮谅哴悢倞辆晾喨湸靓輌諒輛鍄"},
    {"l", "liao",
        "撩蹽辽疗聊尞憀膋僚寥嵺漻潦缭嘹嶚"
        "嶛寮嫽獠遼敹暸璙膫燎橑療鹩竂蟟繚"
        "簝賿豂蹘廫藔屪爎爒飂髎飉鷯了钌釕"
        "鄝蓼憭瞭镽尥尦炓料廖撂窷镣鐐"},
    {"l", "lie",
        "裂列劣劽冽挒茢迾咧姴洌浖埒埓烈哷"
        "烮栵捩猎猟蛚聗趔煭巤颲鴷鮤儠獵"
        "擸犣躐鬛鬣鱲挘"},
    {"l", "lin",
        "拎厸邻阾林临冧啉崊淋晽粦琳碄粼箖"
        "鄰隣隣遴潾嶙獜暽辚燐斴璘霖瞵磷疄"
        "臨繗翷麐轔鏻鳞瀶壣驎麟鱗菻亃僯凛"
        "凜撛澟懔懍廪廩檩檁癛癝吝恡悋赁焛"
        "賃蔺橉甐膦閵蹸藺躏躙躪轥"},
    {"l", "liu",
        "溜熘澑蹓刘畄浏斿流留琉旈畱裗硫遛"
        "旒蒥蓅骝媹嵧馏飗榴瑠镏瘤瑬劉磂駠"
        "鹠橊疁镠璢癅蟉駵麍鎏鎦嚠瀏懰藰鏐"
        "飀騮鐂飅鶹鰡驑柳栁桞珋桺绺锍綹鋶"
        "罶熮橮羀嬼六陆翏廇塯碌鹨磟餾霤雡"
        "飂鬸鷚"},
    {"l", "ling",
        "令伶刢灵坽囹夌苓彾呤姈狑泠柃朎昤"
        "瓴玲皊秢铃竛鸰砱陵羐凌菱淩崚掕婈"
        "棂琌蛉聆紷衑翎舲笭绫羚詅軨跉祾棱"
        "裬蓤龄鈴閝零綾蔆輘霊駖鹷鴒魿霗鲮"
        "錂蕶澪燯霛霝齢鯪酃孁齡櫺醽麢欞爧"
        "龗岭岺袊领領嶺另炩蘦靈"},
    {"l", "long",
        "龙茏咙泷栊昽珑胧竜眬砻聋笼隆湰滝"
        "漋槞嶐窿篭龍癃鏧霳巃巄瀧嚨蘢爖櫳"
        "瓏曨襱朧矓礱礲龒龓籠豅躘聾蠪蠬靇"
        "鑨驡鸗陇拢垄垅篢隴儱壟壠攏竉弄哢"
        "梇徿贚"},
    {"l", "lou",
        "搂瞜娄婁偻蒌溇喽楼漊慺蔞遱廔嘍熡"
        "樓蝼耧耬艛螻軁謱髅髏鞻鷜嵝嶁摟塿"
        "甊篓簍陋屚漏镂瘘瘺瘻鏤露"},
    {"l", "lu",
        "噜撸謢擼嚕卢芦庐泸垆炉枦栌胪鸬舮"
        "舻玈颅鲈馿魲盧璷壚瀘蘆廬嚧獹攎爐"
        "櫨曥瓐臚矑艫籚蠦罏纑鑪髗顱鱸鸕黸"
        "卤虏掳鹵鲁硵虜蓾滷塷澛樐魯磠橹擄"
        "穞镥瀂氌櫓艣鏀鐪艪鑥六圥甪陆侓录"
        "彔坴峍赂辂陸勎娽逯菉渌淕淥硉绿鹿"
        "椂禄祿琭勠僇剹稑盝睩碌賂輅路粶箓"
        "蓼蔍廘漉摝塶辘戮熝樚膔踛醁趢録錄"
        "錴穋潞蕗璐簏螰鴼蹗騄轆簶鹭簬簵鏕"
        "鵦鵱麓鯥騼鏴露籙鷺虂轳焒閊鈩氇轤"},
    {"l", "lv",
        "驴闾榈閭膢氀櫚藘驢吕呂郘侣侶挔捛"
        "捋旅梠祣偻铝稆絽屡缕僂屢膂褛鋁履"
        "褸膐縷儢穭律垏虑绿率氯葎嵂滤綠緑"
        "慮膟箻繂勴濾爈櫖鑢"},
    {"l", "luan",
        "娈峦孪栾挛脟鸾脔滦銮鵉巒孌奱孿圝"
        "攣灓欒曫羉臠圞虊灤鑾癴癵鸞卵乱釠"
        "亂"},
    {"l", "lue", "寽畧稤鋝鋢"}, {"l", "lve", "掠略锊圙"},
    {"l", "lun",
        "抡掄仑伦论芲沦纶囵侖轮倫陯圇淪菕"
        "婨崘崙棆腀碖蜦耣綸輪踚錀鯩埨惀稐"
        "溣論嗧磮"},
    {"l", "luo",
        "捋啰落頱囉罗萝逻猡脶腡椤锣骡箩镙"
        "螺羅覶鏍騾覼蠡儸邏蘿玀攞欏驘鸁籮"
        "鑼饠囖剆倮蓏裸躶瘰蠃臝曪癳泺洛咯"
        "骆峈荦络烙洜珞硌硦絡跞笿詻雒犖摞"
        "漯駱鵅鮥濼纙鮱"},
    {"m", "m", "呒呣姆"},
    {"m", "mai",
        "埋薶霾买荬買嘪鷶劢迈麦佅売卖脉脈"
        "麥衇勱賣邁霡霢蕒"},
    {"m", "ma",
        "亇妈孖抹蚂麻媽嫲摩吗嗎痲痳蔴犘蟆"
        "马犸玛码馬獁溤瑪碼螞鎷鷌鰢杩祃骂"
        "閁唛傌睰嘜禡榪罵駡鬕唜嘛魸蟇"},
    {"m", "man",
        "埋嫚颟顢悗蛮谩蔓馒摱慲樠瞒瞞鞔謾"
        "饅鳗鬘鬗鰻蠻娨屘満满滿螨蟎鏋矕曼"
        "鄤僈蔄幔獌漫缦墁慢熳槾镘澷縵鏝襔"},
    {"m", "mang",
        "邙牤芒吂汒忙尨杧杗氓盲盳笀恾茫厖"
        "庬哤娏狵浝牻釯铓硭痝蛖鋩駹蘉莽莾"
        "硥茻壾漭蟒蠎"},
    {"m", "mao",
        "猫貓毛矛枆茆茅牦旄罞軞酕渵堥楙"
        "锚髦鉾蝥氂髳錨蟊鶜冇夘卯戼峁泖昴"
        "铆笷鉚蓩冃芼皃茂冐冒贸柕眊耄覒袤"
        "貿鄚萺帽媢毷暓瑁愗鄮貌瞀蝐懋毟"},
    {"m", "mei",
        "没沒坆苺枚玫栂眉脄莓郿脢梅珻睂堳"
        "湄湈葿媒猸嵋腜瑂禖楣楳煤酶槑镅鹛"
        "塺鋂霉鎇徾糜攗鶥黴毎每美凂挴浼羙"
        "嵄渼媄媺镁嬍燘躾鎂黣妹抺沬袂昧祙"
        "眛谜寐媚跊鬽痗煝魅韎睸蝞篃"},
    {"m", "me", "乄么匁扖庅嚒濹嚜嚰"},
    {"m", "men",
        "闷门们扪汶玧钔門閅們菛捫璊穈鍆亹"
        "虋焖悶暪燜懑懣椚"},
    {"m", "meng",
        "掹蒙擝尨甿氓虻莔萌溕盟鄳甍蝱鄸儚"
        "蕄瞢橗幪濛懞檬曚氋朦鹲礞鯍矇艨矒"
        "饛霿靀顭鸏黾勐冡猛锰蜢艋錳獴懵蠓"
        "鯭鼆孟梦夢夣懜霥"},
    {"m", "mi",
        "咪眯瞇弥祢迷猕谜蒾詸謎醚糜縻麋麊"
        "麿藌彌擟禰靡麛瀰獼蘪镾蘼戂攠瓕爢"
        "醾醿鸍釄米芈羋侎沵洣弭敉脒渳葞蔝"
        "銤濔孊灖冖糸汨沕泌怽宓觅祕峚宻秘"
        "覔覓密淧幂谧蓂幎覛塓蜜榓鼏蔤滵漞"
        "嘧熐冪樒幦濗謐簚櫁羃鼡袮粎裃椧嚸"
        "欕"},
    {"m", "mian",
        "宀芇杣眠绵婂媔棉綿臱蝒緜嬵檰櫋矈"
        "矊矏丏汅沔免勉俛眄娩渑偭勔冕葂喕"
        "湎睌缅愐腼緬澠靦鮸靣面麪麫糆麺麵"},
    {"m", "miao",
        "喵苗媌描瞄鹋緢嫹鶓劰杪秒眇渺缈淼"
        "緲篎藐邈妙庙竗玅庿缪廟"},
    {"m", "min",
        "民玟苠姄岷怋旻旼盿砇珉罠崏捪缗琘"
        "琝瑉碈痻鈱緍緡錉鴖鍲皿冺刡忟闵黾"
        "抿泯忞敃勄闽悯敏笢閔黽惽湣敯暋愍"
        "閩僶潣憫慜簢鳘蠠鰵垊笽"},
    {"m", "mie",
        "乜吀咩哶孭灭烕搣滅蔑薎鴓幭篾瀎懱"
        "櫗礣蠛衊鑖鱴旀"},
    {"m", "ming",
        "名明鸣眀洺茗冥眳朙铭鄍蓂溟嫇猽詺"
        "銘鳴榠暝瞑螟覭佲姳凕慏酩命掵"},
    {"m", "miu", "谬缪謬"},
    {"m", "mo",
        "摸嚤无尛谟嫫馍模摹膜麽麼摩橅磨糢"
        "謨謩嬷嬤擵饃蘑髍魔劘饝万抹懡末圽"
        "没沫陌妺茉帓殁歾歿枺昩脉帞冒莫莈"
        "皌秣砞眜眿袜絈眽貃蛨貊塻蓦嗼漠寞"
        "獏銆靺魩黙嫼嘿墨瞐瞙瘼镆默貘蟔鏌"
        "藦爅癦驀纆礳耱丆匁乮裃酛魹囕"},
    {"m", "mou",
        "哞牟劺侔呣恈谋眸蛑缪踎謀鍪麰鴾繆"
        "某"},
    {"m", "mu",
        "毪氁模母牡亩姆畂拇畆畒姥峔牳胟砪"
        "畝畞畮鉧踇木目仫牟狇沐坶苜牧炑毣"
        "莫莯蚞钼雮募慔幕幙墓鉬睦楘慕暮暯"
        "艒霂縸穆鞪厼榁"},
    {"n", "na",
        "那南拏拿嗱搻镎鎿乸哪雫内呐吶妠纳"
        "肭郍娜钠衲袦納笝軜豽捺貀鈉靹蒳魶"
        "凪魸噺"},
    {"n", "nai",
        "腉孻乃艿奶氖疓廼迺哪倷釢嬭佴奈柰"
        "耐萘渿鼐褦螚錼"},
    {"n", "nan",
        "囝囡男抩枏柟侽南莮畘难娚喃楠暔諵"
        "難赧萳揇湳煵腩蝻戁婻遖"},
    {"n", "nao",
        "孬呶怓挠峱铙硇蛲詉猱碙撓嶩憹蟯獶"
        "譊夒鐃獿巎垴恼悩脑脳匘堖惱瑙嫐腦"
        "碯闹淖閙鬧臑"},
    {"n", "nang", "囊囔乪嚢蠰馕欜饢擃曩攮灢儾齉"}, {"n", "ne", "哪疒那讷呐抐眲訥丆匁鼡縇"},
    {"n", "nei", "哪娞馁脮腇餒鮾鯘内內那氝氞錗"}, {"n", "nen", "恁嫩嫰"}, {"n", "neng", "能"}, {"n", "ng", "嗯唔"},
    {"n", "ni",
        "妮尼泥兒呢坭怩籾秜铌郳倪屔淣婗"
        "猊蚭埿棿跜鈮馜蜺聣輗觬貎鲵霓麑"
        "鯢齯臡拟你伲伱苨妳狔抳柅掜旎晲"
        "孴隬儗儞薿擬聻屰氼逆胒昵匿眤堄"
        "惄腻愵溺嫟睨暱縌誽膩嬺嶷檷哛鳰"},
    {"n", "nian",
        "拈蔫年秊秊哖姩秥粘鲇鲶鮎黏鯰涊"
        "淰捻辇辗碾輦撵撚簐蹍攆蹨躎卄廿"
        "念唸埝惗艌焾"},
    {"n", "niang", "娘嬢孃酿醸釀"}, {"n", "niao", "鸟茑袅鳥嫋裊蔦樢褭嬝嬲尿脲溺"},
    {"n", "nie",
        "捏捻揑苶乜帇圼枿陧涅聂痆臬隉菍"
        "啮湼敜嵲嗫踂踗踙摰镊镍噛槷嶭篞"
        "臲錜颞蹑聶嚙鎳闑孽孼櫱蘖籋囁齧"
        "鑈巕蠥糱糵囓躡讘鑷顳钀"},
    {"n", "nin", "囜您拰脌"},
    {"n", "ning",
        "宁苧咛狞拧柠聍甯寍寕寗寜寧凝儜"
        "橣擰獰嚀薴嬣檸聹鑏鬡鸋矃佞侫泞"
        "倿澝濘"},
    {"n", "niu",
        "妞牛牜汼狃扭纽忸炄杻钮紐莥鈕靵"
        "拗"},
    {"n", "nou", "羺槈耨獳鎒檽鐞鯑"},
    {"n", "nong",
        "农侬浓哝脓秾農辳儂蕽濃噥膿燶檂"
        "禯穠襛譨醲欁鬞繷弄挊挵癑齈"},
    {"n", "nu", "奴伮驽孥笯駑努弩呶砮胬怒傉搙莻"}, {"n", "nv", "女钕籹釹沑衂恧朒衄"}, {"n", "nuan", "奻渜煗暖餪"},
    {"n", "nun", "黁"}, {"n", "nve", "疟虐"},
    {"n", "nuo",
        "那娜挪梛傩橠儺诺逽喏掿愞搦锘榒"
        "稬諾蹃鍩糑懧懦糥穤糯"},
    {"o", "ou",
        "区讴沤欧殴瓯鸥塸熰歐鴎甌膒毆謳"
        "藲櫙鏂鷗呕吘偶腢嘔蕅耦藕怄慪漚"},
    {"o", "o", "噢哦丆仒乯迲猠硛旕筽鳰縇穒纐"},
    {"p", "pa",
        "叭汃妑苩派皅趴舥啪葩扒杷爬耙掱"
        "琶筢潖帊帕怕袙巼"},
    {"p", "pai",
        "拍俳徘猅排棑牌箄輫簰簲迫沠派哌"
        "渒湃蒎鎃闏"},
    {"p", "pan",
        "扳拌眅萠番潘攀丬爿洀柈胖般盘跘"
        "蒰幋媻槃搫盤磐縏磻蹒蹣鎜蟠瀊鞶"
        "坢冸判伴沜泮拚炍牉盼叛畔袢詊溿"
        "頖鋬鵥襻鑻"},
    {"p", "pang",
        "乓胮雱滂膀膖霶仿彷厐庞逄旁舽嫎"
        "徬磅螃鳑龎龐鰟嗙耪覫髈炐肨胖眫"},
    {"p", "pao",
        "抛拋泡脬萢刨庖咆狍垉炰炮爮袍匏"
        "袌軳跑鞄麃麅奅疱皰砲靤麭礟礮喸"
        "褜"},
    {"p", "pei",
        "呸怌肧胚衃醅阫陪培赔毰锫裴裵賠"
        "錇俖伂犻沛佩帔姵斾旆珮配浿辔馷"
        "霈轡蓜"},
    {"p", "pen", "喷噴濆歕瓫盆葐湓呠翸喯"},
    {"p", "pi",
        "丕伓伾批纰邳坯炋枈披抷狉狓岯砒"
        "紕被秛秠铍悂旇耚翍豾鈚釽鉟銔髬"
        "駓磇劈噼錃魾錍憵鎞礔礕霹皮阰陂"
        "芘肶枇毗毘郫陴疲蚍蚾蚽豼埤啤崥"
        "琵焷脾腗椑裨鈹鲏蜱罴膍隦魮鮍壀"
        "篺螷鵧貔羆鼙蠯匹庀仳圮苉吡否脴"
        "痞銢鴄諀嶏擗噽癖嚭屁淠揊媲嫓睥"
        "辟稫潎僻澼甓疈譬闢鸊鷿迲"},
    {"p", "peng",
        "匉抨泙怦恲砰硑烹梈軯閛剻漰嘭駍"
        "磞芃朋竼莑倗捀堋弸袶彭棚椖搒塜"
        "塳傰蓬稝鹏硼樥熢澎憉輣錋篷篣膨"
        "韸髼鬅蟛蟚纄蘕韼鵬鬔騯鑝捧淎皏"
        "掽椪碰槰踫輧"},
    {"p", "pian",
        "片囨扁偏媥犏翩篇鶣便骈胼腁缏楄"
        "楩賆跰褊骿駢蹁騈谝覑貵諞骗騙騗"},
    {"p", "piao",
        "票剽勡嘌彯漂缥飘旚螵翲犥飄飃魒"
        "朴嫖瓢薸闝莩殍瞟縹篻醥顠皫僄徱"
        "骠慓驃鰾"},
    {"p", "pie", "氕覕撇暼撆瞥丿苤鐅嫳"},
    {"p", "ping",
        "乒甹俜娉涄砯聠艵頩冯平评苹郱凭"
        "呯坪枰玶胓屏洴帡荓瓶蚲萍帲淜幈"
        "蓱蛢缾甁塀焩評鲆軿竮凴箳慿憑鮃"
        "檘簈屛岼"},
    {"p", "pin",
        "拚拼姘砏礗穦馪驞贫玭娦貧琕嫔频"
        "嬪薲蘋嚬矉颦顰品榀牝汖娉聘朩"},
    {"p", "po",
        "朴钋陂岥泊泼坡釙颇酦頗潑醗醱"
        "鏺婆鄱蔢嘙皤繁櫇嚩叵尀钷笸鉕箥"
        "駊廹迫岶洦敀昢珀破砶烞粕湐蒪魄"
        "乶哛桲"},
    {"p", "pou", "剖娝抔抙捊垺掊裒箁咅哣婄犃"},
    {"p", "pu",
        "仆攵攴扑抪炇陠铺痡鋪噗撲潽鯆圤"
        "匍莆菩脯葡菐蒱蒲僕酺墣獛璞穙镤"
        "瞨濮贌鏷纀朴浦埔圃烳普圑溥谱暜"
        "諩樸擈氆檏镨譜蹼鐠堡舖舗暴瀑曝"
        "巬哛"},
    {"q", "qi",
        "七迉沏妻柒栖桤凄郪倛娸捿淒悽萋"
        "戚桼棲敧欺欹期攲紪缉傶僛嘁墄漆"
        "慽緀榿慼踦霋魌蹊鏚鶈丌亓祁齐圻"
        "忯芪岐岓奇其亝祈祇斉肵歧疧俟荠"
        "剘陭旂耆蚑蚔蚚脐斊竒颀畦軝跂釮"
        "埼萁萕帺骐骑猉崎掑淇棋棊祺蛴琪"
        "琦锜褀碕碁鬿頎愭﨑齊旗綥粸綦蜞"
        "蜝璂禥蕲錡鲯藄鄿濝懠檱櫀鳍騏騎"
        "臍鵸鶀鯕蘄麒鬐艩蠐騹鰭玂麡乞邔"
        "企芑岂屺杞玘盀启呇唘豈起啓啟啔"
        "婍绮棨晵綮綺稽諬闙气讫迄汔気汽"
        "芞弃矵呮泣炁亟盵契咠砌訖栔氣欫"
        "唭葺湆湇棄夡愒滊摖暣甈碶憇槭噐"
        "器憩碛磜磧磩藒蟿罊鐑嵜褄螧簯簱"
        "籏"},
    {"q", "qia",
        "掐袷葜擖拤卡峠酠跒鞐圶冾帢洽恰"
        "胢硈殎髂"},
    {"q", "qian",
        "千阡仟芊迁扦奷汘圱圲汧岍杄茾佥"
        "欦钎臤牵拪悭蚈铅谸釺婜牽孯掔谦"
        "鈆鉛鹐签愆僉嗛骞撁搴慳遷厱諐褰"
        "謙顅檶櫏攐攑簽鵮騫攓籖鬜鬝籤韆"
        "仱岒扲忴拑乹前荨钤钱钳虔歬軡乾"
        "偂掮揵亁媊葥鈐靬犍鉗銭墘榩箝蕁"
        "潜潛羬黔橬錢黚騝騚濳灊鰬浅肷淺"
        "遣膁蜸槏谴缱繾譴欠刋伣纤芡茜俔"
        "倩悓堑椠棈傔嵌皘蒨慊塹蔳綪歉篏"
        "儙槧篟輤縴壍嬱竏粁鎆鏲"},
    {"q", "qing",
        "靑青轻氢郬卿倾寈清淸埥圊氫軽"
        "傾蜻輕錆鲭鯖鑋夝甠剠勍啨情殑棾"
        "葝氰晴暒擏樈檠擎黥苘顷请頃"
        "庼廎漀請謦檾庆亲凊倩掅殸碃綮箐"
        "靘慶磬罄濪儬硘櫦"},
    {"q", "qie",
        "切癿伽茄聺且妾怯厒砌窃匧悏挈洯"
        "惬淁笡蛪趄愜慊朅锲箧篋踥鍥穕鯜"
        "竊"},
    {"q", "qin",
        "侵亲钦衾骎媇嵚欽綅嵰誛嶔親顉駸"
        "鮼寴芹芩庈肣矜秦蚙菦埐珡耹捦菳"
        "禽覃鈙鈫雂琴琹溱勤靲嫀嗪廑慬嶜"
        "擒噙鳹斳澿檎懄螓瘽懃蠄鵭坅昑笉"
        "赾梫寑锓寝寢鋟螼吣吢抋沁唚菣揿"
        "搇撳藽瀙"},
    {"q", "qiao",
        "悄郻硗雀跷鄡鄥勪踍敲毃锹劁骹頝"
        "墝墽燆橇幧缲磽鍫鍬繑繰趬蹺鐰乔"
        "侨荞荍峤桥菬硚喬翘僑谯槗墧憔蕉"
        "蕎嘺嫶鞒犞燋樵橋瞧癄礄翹譙趫櫵"
        "藮鐈鞽顦巧釥愀髜壳陗俏诮帩峭窍"
        "誚髚僺撬撽韒鞘鞩竅躈"},
    {"q", "qiang",
        "羌呛抢斨枪戗戕玱羗将猐啌跄腔溬"
        "嗴獇椌蜣锖锵羫槍牄瑲戧嶈摤篬謒"
        "镪蹌蹡鎗鏘強强蔷嫱墙樯蔃漒薔彊"
        "廧墻嬙檣牆艢蘠羟羥搶墏襁繈繦鏹"
        "炝唴嗆熗羻"},
    {"q", "qiu",
        "丘丠龟邱坵恘秋秌恷蚯媝湫萩楸湬"
        "蓲鹙蝵緧篍趥穐鳅鞦鞧蟗鶖鰌鰍蠤"
        "龝仇叴芁扏囚犰玌朹肍汓虬求虯泅"
        "俅訄訅酋觓釚唒莍逑逎浗紌毬球梂"
        "赇殏釻頄渞湭遒巯崷盚皳絿蛷煪裘"
        "觩巰賕蝤璆銶醔鼽鮂鯄鰽搝糗蘒"
        "蘒"},
    {"q", "qu",
        "区曲匤阹佉伹诎驱岖岴屈抾坥浀胠"
        "祛袪蛆紶躯區焌煀詘趋筁蛐粬趍駆"
        "憈嶇敺駈誳麹魼髷麯趨軀覰麴鶌黢"
        "驅鰸鱋佢劬斪朐胊菃鸲絇翑渠淭葋"
        "軥蕖璖鴝磲螶蟝璩瞿鼩蘧忂灈戵爠"
        "臞氍欋籧癯蠷衢欔躣鑺蠼鸜苣取竘"
        "娶詓竬蝺龋齲去厺刞呿耝阒觑趣閴"
        "麮鼁闃覷覻衐"},
    {"q", "que",
        "炔缺缼蒛阙瘸芍却卻崅埆琷悫雀确"
        "硞棤阕塙搉鹊皵碏榷愨慤碻確趞闋"
        "燩闕礐鵲礭"},
    {"q", "qiong",
        "銎邛卭宆穷穹茕桏筇笻赹惸焪焭"
        "琼蛩蛬舼跫睘煢熍瞏窮憌橩璚儝藑"
        "藭瓊竆瓗嬛"},
    {"q", "quan",
        "奍弮悛圈圏棬椦箞鐉全权卷诠佺姾"
        "荃峑洤恮泉牷辁拳铨痊硂惓埢婘啳"
        "葲湶絟筌犈瑔輇觠詮搼跧銓蜷権踡"
        "駩醛鳈鬈騡鰁巏權齤颧蠸顴犭犬犮"
        "畎烇绻綣虇劝券牶勧韏縓勸楾闎"},
    {"q", "qun", "夋囷逡帬宭峮裙群羣裠麇"}, {"r", "rao", "荛娆饶桡嬈蕘橈襓饒扰隢擾绕遶繞"},
    {"r", "rang",
        "嚷穣勷儴蘘獽瀼禳瓤穰躟鬤壌壤攘"
        "爙让懹譲讓"},
    {"r", "ran",
        "呥肰衻袇袡蚦蚺然髥髯嘫燃繎冄冉"
        "苒姌染珃媣橪"},
    {"r", "re", "若喏惹热熱"}, {"r", "reng", "扔仍辸礽芿陾艿"},
    {"r", "ren",
        "人亻仁壬朲忈任芢忎秂魜銋鵀忍荏"
        "荵栠栣秹稔躵刃刄认讱仞仭纫屻饪"
        "牣纴轫杒妊韧肕祍姙衽紉紝軔訒袵"
        "梕葚腍絍鈓飪靭靱韌餁認"},
    {"r", "rong",
        "戎肜栄茸荣茙狨绒毧峵容烿媶嵘搑"
        "傛絨羢搈溶嵤嫆蓉榵榕榮熔穁瑢縙"
        "镕褣蝾槦融螎駥嬫嶸爃鎔瀜曧蠑冗"
        "宂坈傇軵氄穃"},
    {"r", "ri",
        "日驲囸衵釰釼鈤馹乤乬乫乮乭乶乽"
        "乼乺挘艝鑓虄"},
    {"r", "rou",
        "厹禸柔粈脜葇媃揉渘楺瑈腬煣蝚糅"
        "輮蹂鍒鞣騥瓇鶔鰇韖肉宍譳"},
    {"r", "ru",
        "邚如侞帤茹挐桇铷袽渪筎蒘銣蝡蕠"
        "儒鴑鴽嚅薷濡孺嬬曘襦蠕颥醹顬鱬"
        "汝肗乳辱鄏擩入洳溽缛蓐嗕媷褥縟"
        "扖杁嶿"},
    {"r", "rui",
        "甤緌蕤桵蕊蕋橤繠蘂蘃壡芮汭枘蚋"
        "锐蜹瑞睿鋭銳叡"},
    {"r", "ruan",
        "堧撋壖阮软朊耎軟偄媆瑌腝碝緛輭"
        "瓀礝"},
    {"r", "run", "闰润閏閠潤橍膶"},
    {"r", "ruo",
        "挼捼叒若鄀偌弱婼渃焫楉蒻箬篛爇"
        "鰙鰯鶸嵶"},
    {"s", "sang", "丧桒桑喪槡嗓搡磉褬颡鎟顙"},
    {"s", "san",
        "三弎参叁毵毶厁毿犙鬖伞傘散糁馓"
        "糝糣糤繖鏒鏾饊俕閐壭"},
    {"s", "sai",
        "思毢愢揌塞腮毸嘥噻鳃顋鰓赛僿賽"
        "簺嗮"},
    {"s", "sa",
        "仨撒洒訯靸潵灑躠卅钑飒脎萨鈒馺"
        "摋蕯颯薩櫒扨苆乷栍隡虄"},
    {"s", "sao",
        "掻搔溞骚慅缫螦繅鳋颾騒騷鰠鱢扫"
        "掃嫂埽瘙燥氉臊矂髞乺"},
    {"s", "seng", "僧鬙"}, {"s", "sen", "森椮槮襂"},
    {"s", "se",
        "閪色洓涩栜啬渋铯雭歮嗇瑟塞摵歰"
        "銫澁濇濏擌懎瘷穑璱澀瀒穡繬轖穯"
        "鏼譅飋縇鱪"},
    {"s", "sha",
        "杀杉沙纱刹砂殺莎唦猀粆紗挲铩桬"
        "痧硰摋煞蔱裟榝樧噎鲨魦閷髿鯊鯋"
        "鎩繺奢啥傻儍倽萐帹啑唼喢厦廈嗄"
        "歃翜翣箑閯霎"},
    {"s", "shai", "筛酾篩簁簛籭色晒曬"},
    {"s", "shang",
        "汤伤殇商觞禓傷蔏滳漡墒慯殤熵螪"
        "觴謪鬺上垧扄晌赏樉賞鋿鏛贘鑜丄"
        "尚尙恦绱緔鞝"},
    {"s", "shan",
        "山彡邖删刪芟杉钐衫苫姗姍狦挻舢"
        "珊栅柵脠痁扇軕掺笘釤傓跚剼搧煽"
        "幓嘇潸澘鯅縿膻檆羴羶闪陕陝炶閃"
        "晱睒煔熌覢讪汕疝单訕剡赸掸掞善"
        "椫禅銏骟鄯僐缮墠墡樿敾歚擅"
        "嬗禪膳磰赡謆繕蟮蟺鐥饍鳝騸贍譱"
        "灗鱓鱔圸"},
    {"s", "she",
        "奢猞赊畬畲畭輋賖賒檨舌佘折虵蛇"
        "阇揲蛥舍捨叶厍设社舎厙拾涉射赦"
        "設渉涻弽滠慑摄摂蔎慴歙蠂韘騇麝"
        "懾灄攝欇"},
    {"s", "shao",
        "莦弰捎烧梢稍焼萷旓蛸艄筲輎鞘燒"
        "髾鮹勺芍杓苕柖玿韶少邵卲劭绍袑"
        "哨娋紹睄綤潲蕱"},
    {"s", "shei", "谁"},
    {"s", "shen",
        "申扟屾伸身籶侁参诜冞罙呻妽绅柛"
        "氠穼珅姺籸娠峷莘眒甡砷深紳敒兟"
        "訷棯裑葠蓡罧詵糁甧蔘糂鲹駪薓燊"
        "曑鵢鯓鯵鰺什神甚鉮鰰邥弞沈矤审"
        "哂矧谂谉婶訠渖諗審頣魫曋瞫瀋嬸"
        "讅覾肾胂侺昚涁眘脤渗祳葚腎瘆慎"
        "愼椹蜃蜄滲鋠瘮堔榊籡"},
    {"s", "shou",
        "収收熟扌手守首垨艏寿受狩兽售授"
        "涭绶痩膄壽夀瘦綬獣獸鏉"},
    {"s", "shi",
        "尸失师呞邿诗鸤虱狮施屍浉師絁"
        "釶葹湿湤溼溮蒒蓍鉇詩獅瑡酾鳲嘘"
        "鳾箷蝨褷鲺鍦濕鯴鰤鶳襹釃十饣什"
        "石时识实実旹飠食祏炻蚀拾姼峕埘"
        "莳時遈寔湜溡塒鉐實榯蝕鲥鼫鼭識"
        "鰣史矢乨豕使驶始屎宩兘笶鉂駛士"
        "氏礻示市世丗仕似卋忕式戺亊事侍"
        "势试呩饰视柹柿枾昰是贳恃恀眂峙"
        "拭冟室适逝眎眡铈舐轼烒栻秲釈視"
        "释貰弑谥徥揓崼嗜蒔勢弒軾筮睗觢"
        "試鈰鉃飾鉽誓舓適奭餝餙銴諡諟澨"
        "噬嬕遾螫謚簭釋襫乄辻佦竍嵵煶鮖"
        "籂鰘籡鱰"},
    {"s", "sheng",
        "升生阩呏声斘枡昇泩狌苼陞珄牲殅"
        "陹笙湦焺甥鉎鍟聲鼪鵿渑绳憴縄繉"
        "繩譝省眚偗渻圣胜晟晠乘剰盛貹剩"
        "勝嵊琞聖墭榺蕂賸竔曻﨡橳"},
    {"s", "shu",
        "书殳抒纾陎叔枢杸姝荼倏倐殊紓書"
        "焂梳鄃菽婌掓軗淑疏疎舒琡綀毹毺"
        "摅输跾踈蔬樞輸鮛橾儵攄鵨尗秫孰"
        "赎塾熟璹贖属暑暏黍鼠蜀数署潻薯"
        "薥曙癙藷襡襩屬术朮戍束沭述侸荗"
        "咰树怷竖恕捒庶庻蒁絉術裋尌鉥腧"
        "竪墅漱潄澍數豎錰霔濖樹鶐鏣虪瀭"
        "糬蠴"},
    {"s", "shua", "刷唰耍誜"},
    {"s", "shuang",
        "双泷爽霜雙骦孀孇騻欆鷞鹴礵艭驦"
        "鸘漺慡縔塽灀﨎鏯"},
    {"s", "shuan", "闩拴閂栓涮腨"}, {"s", "shuai", "衰摔甩帅帥率蟀卛"}, {"s", "shui", "谁脽誰氵水氺说帨涗涚祱税稅裞睡"},
    {"s", "shun", "楯吮顺順舜蕣橓瞚瞤瞬鬊"},
    {"s", "song",
        "忪松枀枩柗娀凇倯菘庺崧淞梥硹嵩"
        "濍憽檧鬆怂悚耸竦愯楤傱嵷慫聳"
        "駷讼宋诵送訟颂頌誦鎹餸"},
    {"s", "shuo",
        "说説說妁烁朔铄硕欶矟蒴搠獡槊碩"
        "箾鎙爍鑠"},
    {"s", "si",
        "厶纟丝司糹私泀咝俬思恖鸶虒偲"
        "缌媤蛳斯絲鉰楒禗飔凘厮禠蜤锶銯"
        "罳鋖緦磃澌嘶噝撕蕬廝燍螄鍶颸蟖"
        "蟴騦鐁鷥鼶死巳亖四似寺汜泤姒兕"
        "伺佀祀孠杫価驷饲泗洠娰俟枱柶牭"
        "食飤肂涘洍耜耛梩笥釲覗竢肆嗣貄"
        "鈶鈻飼榹禩駟蕼儩瀃厑唜旕鯐鶍"},
    {"s", "sou",
        "叟凁捜鄋搜蒐蓃廀廋嗖獀馊溲飕摉"
        "摗锼螋艘醙鎪餿颼騪叜傁嗾瞍擞薮"
        "藪櫢籔嗽瘶擻"},
    {"s", "su",
        "苏甦酥窣稣穌鯂蘓蘇櫯囌俗玊夙诉"
        "泝肃洬涑莤速珟素粛殐梀骕宿谡傃"
        "粟訴肅鹔愫塑塐遡嫊嗉溯溸缩遬蔌"
        "僳榡愬膆趚觫鋉餗碿樎樕憟潥潚縤"
        "簌謖藗橚璛蹜驌鷫鱐苆"},
    {"s", "suan", "狻痠酸匴祘笇筭蒜算"},
    {"s", "sui",
        "夊芕尿虽浽荾哸倠隋眭睢滖熣鞖濉"
        "雖绥随遂遀綏隨髄瓍膸瀡髓亗岁砕"
        "祟谇埣嵗煫歲歳碎睟粹隧澻穂嬘賥"
        "誶燧檖禭璲穗穟邃襚繀繐繸旞譢鐆"
        "鐩韢荽"},
    {"s", "sun",
        "孙狲荪孫飧飱猻搎蓀槂蕵薞笋损隼"
        "筍損榫箰簨鎨鶽潠"},
    {"s", "suo",
        "莎莏唆娑挱桫梭挲傞睃嗍蓑羧摍缩"
        "趖簑簔縮鮻所唢索琐惢锁嗩溑暛褨"
        "瑣璅鎖鎻鎍鏁逤溹蜶琑嗦鱛"},
    {"t", "ta",
        "他它她牠祂铊趿鉈溻塌榙禢褟踏溚"
        "塔墖獭鮙鳎獺鰨拓沓挞闼狧粏崉"
        "涾傝嗒遝阘搨漯毾榻澾撻誻錔橽嚃"
        "鞜蹋濌鞳闒蹹闥嚺譶躢侤萙遢燵襨"
        "鶎鱩"},
    {"t", "tan",
        "坍贪怹痑啴舑貪滩摊嘽瘫潬擹攤灘"
        "癱坛昙郯倓谈弹婒埮惔覃锬痰榃谭"
        "潭憛墰墵談醈曇錟壇燂橝澹檀顃罈"
        "藫壜譚醰貚譠罎忐坦钽袒菼毯僋鉭"
        "嗿憳憻醓暺璮叹炭探湠嘆碳舕歎"},
    {"t", "tai",
        "台囼孡苔胎邰旲坮骀抬炱炲菭跆鲐"
        "颱臺箈駘鮐儓薹擡嬯檯籉呔太夳冭"
        "汏汰汱忲肽态钛舦泰酞鈦溙態燤"},
    {"t", "tao",
        "夲叨弢涛绦掏焘絛詜慆搯滔幍嫍槄"
        "瑫韬飸縚縧轁濤謟鞱韜饕迯匋洮逃"
        "咷陶桃梼萄淘绹啕祹裪蜪綯鞀鞉醄"
        "鋾駣騊饀鼗讨討套"},
    {"t", "tang",
        "汤铴湯嘡羰劏蝪趟薚镗蹚鏜鞺鼞坣"
        "唐堂棠啺鄌傏蓎隚搪溏塘煻榶漟禟"
        "瑭膅膛磄糃樘橖糖螗篖踼赯醣螳糛"
        "鎕餹饄闛鶶伖帑倘偒淌惝傥耥躺镋"
        "鎲儻戃爣曭矘钂烫摥燙鐋"},
    {"t", "te", "忑忒特铽慝鋱蟘朰扨脦罀"},
    {"t", "teng",
        "膯鼟疼痋幐腾誊漛滕邆駦螣縢謄"
        "儯藤騰鰧籐籘虅驣霯"},
    {"t", "tiao",
        "旫佻庣挑恌祧聎芀条苕迢岧岹祒條"
        "调萔笤蓚蓨龆樤蜩鋚鲦鞗髫鯈鎥齠"
        "鰷宨晀朓脁窕誂窱斢嬥眺粜絩覜趒"
        "跳糶"},
    {"t", "tian",
        "天兲婖添酟靔黇靝田佃沺屇恬胋畋"
        "畑畠钿甜甛菾湉填塡嗔阗搷碵緂窴"
        "磌璳闐鷆鷏忝殄倎唺淟悿觍晪琠腆"
        "睓痶舔餂瑱賟覥錪掭舚鴫"},
    {"t", "ti",
        "体剔梯锑踢銻擿鷉鷈厗荑绨偍媞"
        "崹提渧缇惿遆啼稊鹈罤题瑅綈嗁睼"
        "褆碮漽蕛徲緹醍趧蹄蹏鍗鳀謕鮷題"
        "鵜騠鶗鶙鯷禵鷤挮躰骵軆體戻屉洟"
        "剃俶倜逖涕悌惕屜掦逷啑笹悐惖替"
        "揥裼褅歒髰殢薙嚏鬀鬄瓋嚔籊趯"},
    {"t", "tie",
        "帖怗贴萜聑貼铁蛈鉄銕僣鐡鐵驖呫"
        "飻餮"},
    {"t", "tou",
        "偷偸媮婾鋀鍮亠头投骰頭妵紏敨黈"
        "蘣透"},
    {"t", "tu",
        "凸宊秃禿怢突涋捸湥堗葖痜嶀鋵鵚"
        "鼵図图凃荼徒途庩峹捈涂悇梌屠菟"
        "揬稌瘏筡鈯嵞塗蒤腯廜潳瑹酴跿圖"
        "圗馟駼鍎鵌鶟鷋鷵土圡吐钍唋釷兎"
        "迌兔莵堍鵵汢溌"},
    {"t", "tong",
        "恫炵通痌絧嗵蓪熥樋仝同彤佟侗庝"
        "峂峒峝哃狪茼垌烔晍桐浵砼蚒秱铜"
        "眮童粡赨詷酮鉖銅鉵餇鲖勭僮潼獞"
        "橦犝曈朣膧燑氃穜瞳鮦统捅桶統筒"
        "筩綂恸痛衕慟憅"},
    {"t", "ting",
        "厅庁汀町听耓烃厛烴桯綎鞓聴聼廰"
        "聽廳邒廷莛庭亭停葶婷嵉渟蜓筳楟"
        "榳閮霆蝏聤諪鼮圢甼侹娗挺涏烶梃"
        "珽脡铤艇颋誔鋌頲"},
    {"t", "tuan",
        "猯湍圕煓貒团団抟剸摶漙團慱槫篿"
        "檲鏄糰鷒鷻畽墥疃彖湪褖"},
    {"t", "tun",
        "吞呑旽涒焞朜噋暾屯坉囤忳芚蛌軘"
        "豚豘飩鲀魨黗霕臀臋氽褪饨"},
    {"t", "tui",
        "忒推蓷藬弚颓隤尵橔頹頺頽魋蘈穨"
        "蹪俀腿僓蹆骽侻退娧煺蜕蛻褪駾燵"},
    {"t", "tuo",
        "乇仛讬饦托扡汑杔佗侂咜咃沰拖拕"
        "说侻莌捝挩袥託飥涶脱脫馲魠鮵阤"
        "驮陁陀驼狏岮沱坨柁鸵砣砤袉紽詑"
        "酡跎堶馱碢槖駄駝駞橐鴕鮀鼧鵎騨"
        "鼍驒驝鼉彵妥庹椭楕嫷橢鰖拓柝毤"
        "萚唾跅毻箨嶞魄蘀籜鵇"},
    {"w", "wa",
        "屲凹穵劸洼哇挖娲窊畖窐媧啘嗗瓾"
        "蛙搲溛漥窪鼃韈攨娃瓦邷佤咓砙袜"
        "聉嗢腽膃襪韤瓸甅"},
    {"w", "wai", "咼歪喎竵崴外顡"},
    {"w", "wei",
        "厃危委威烓隈隇偎逶喴葳葨媙崴嵔"
        "揻揋愄溦椳楲詴煨微蜲蝛覣縅薇燰"
        "鳂癓鰃鰄巍霺囗为韦圩围囲闱违帏"
        "沩洈峗峞為韋桅涠帷唯维惟琟嵬媁"
        "圍喡幃違湋溈爲維潍鄬蓶潿潙醀鍏"
        "闈鮠濰壝矀覹犩欈伟伪苇芛尾纬炜"
        "玮洧浘娓荱诿隗偽偉萎崣梶痏硊骩"
        "骫骪愇猥渨蒍葦徫廆椲暐煒艉痿瑋"
        "韪腲鲔撱嶉僞寪蔿頠緯諉踓韑薳儰"
        "濻鍡鮪颹韙瀢韡亹斖卫未位苿味胃"
        "畏軎叞菋谓硙尉遗喂媦猬渭煟蔚碨"
        "蜼蝟磑犚慰緭熭衛衞餧鮇懀謂罻螱"
        "褽魏餵轊藯鏏鳚霨蘶饖讆躗躛讏捤"
        "墛嶶"},
    {"w", "wang",
        "尢尣尪汪尫尩亾兦亡王仼莣蚟罓罒"
        "网彺往徃罔枉惘菵辋棢暀蛧蝄網輞"
        "誷魍瀇妄迋忘旺徍望朢"},
    {"w", "wen",
        "昷温溫辒殟榅瑥瘟榲緼蕰豱輼轀鳁"
        "鞰鰛鰮文芠彣纹炆闻蚊蚉紋阌珳雯"
        "駇馼聞瘒鳼鴍魰螡閿閺闅蟁鼤繧闦"
        "刎伆吻呅抆呡肳紊桽脗稳穏穩问妏"
        "免汶莬問渂揾搵絻顐璺塭鎾饂"},
    {"w", "wan",
        "涴弯剜帵婠湾塆睕蜿豌潫彎壪灣丸"
        "刓芄汍纨完岏抏玩紈捖顽貦烷頑翫"
        "宛倇莞挽盌唍绾埦惋梚菀萖婉脘晚"
        "晥晩晼琬皖椀碗畹綰綩輓踠鋔万卐"
        "卍忨妧捥脕腕萬蔓輐澫鋄錽薍瞣蟃"
        "贃鎫贎乛杤笂琓"},
    {"w", "weng",
        "翁嗡滃鹟螉聬鎓鶲勜奣嵡蓊塕暡瞈"
        "攚瓮蕹甕罋齆"},
    {"w", "wo",
        "挝涡倭莴萵唩猧渦涹窝喔窩蜗蝸踒"
        "我婑婐捰仴沃肟枂卧臥捾涴偓幄媉"
        "渥握焥硪楃腛斡瞃龌臒瓁濣齷遤"},
    {"w", "wu",
        "兀乌邬弙污汙汚圬呜巫杇於屋洿诬"
        "钨恶烏剭窏鄔嗚誈誣歍箼螐鴮鎢鰞"
        "亡无毋芜吾吴吳呉郚茣莁唔娪峿浯"
        "洖梧祦珸铻鹀無蜈鋙蕪墲橆璑鵐蟱"
        "鯃譕鼯鷡五午伍仵迕妩庑怃忤玝"
        "武侮倵逜陚捂娒娬牾啎珷鹉碔摀熓"
        "瑦舞憮潕廡嫵儛甒瞴鵡躌兀勿阢务"
        "戊扤屼岉芴坞杌物忢旿矹卼敄俉误"
        "務悟悮悞粅晤焐痦婺隖骛嵍靰雾雺"
        "嵨奦溩塢鹜熃寤誤鋈窹霚鼿齀霧騖"
        "蘁鶩厼朰鯲"},

    {"x", "xi",
        "夕兮邜吸汐忚西扸希卥析昔穸肸肹"
        "矽怸饻恓郗茜俙徆莃奚娭唏浠狶悕"
        "屖栖牺氥息悉硒琋赥釸欷晞桸惜烯"
        "焁焈淅渓唽菥傒鄎焟焬犀晰晳翕翖"
        "舾粞稀睎惁腊锡皙裼煕厀徯蒠溪嵠"
        "僖熙熈熄榽蜥緆餏覡豨瘜磎膝潝嘻"
        "噏嬉嬆凞樨橀暿歙熺熻熹螅螇窸羲"
        "錫貕蹊豯蟋谿豀瞦燨犠巂繥糦鵗譆"
        "醯觹鏭鐊隵酅巇嚱犧曦爔饎觽鼷鸂"
        "蠵觿鑴习郋席觋習袭喺媳蓆蒵椺嶍"
        "漝趘槢褶薂隰檄謵鎴鳛霫飁騱騽鰼"
        "襲驨洗枲玺铣徙喜葸葈鈢鉨鉩蓰漇"
        "屣憘歖禧憙諰謑縰壐蟢蹝璽鱚矖囍"
        "躧匸卌戏饩屃系呬细郄怬忥盻恄郤"
        "係咥屓绤欯阋細釳趇舄舃塈隙椞禊"
        "慀隟綌赩熂墍犔稧潟澙戯蕮覤縘黖"
        "戱戲磶虩餼鬩繫闟霼衋屭巪凩巼夞"
        "莻唟裃硳喸聢噺橲礂鯐"},
    {"x", "xia",
        "呷虾谺閕傄颬煆瞎蝦鰕匣狎侠俠狭"
        "陜峡炠柙烚峽埉狹祫珨硖翈舺陿假"
        "葭硤遐筪瑕舝敮暇辖碬磍蕸縖赮魻"
        "霞鍜轄鎋黠騢鶷閜丅下吓疜夏唬厦"
        "睱諕懗罅夓鎼鏬圷梺"},
    {"x", "xian",
        "仚仙屳纤先奾忺佡氙杴秈苮祆枮籼"
        "莶珗掀铦锨酰跹僊僲銛鲜嘕韯銽暹"
        "薟憸嬐鍁韱鮮褼繊蹮馦孅攕廯纎鶱"
        "躚襳纖鱻闲伭弦咁妶贤胘涎盷咸挦"
        "娴娹婱蚿絃衔舷閑閒蛝鹇痫湺啣嗛"
        "嫌甉銜誸賢羬稴澖憪嫻嫺撏諴醎輱"
        "癇癎瞯藖礥鹹麙贒鷼鷳鷴冼狝险洗"
        "显烍毨蚬崄険猃赻铣筅蜆跣禒搟尠"
        "尟銑箲險獫嶮獮藓鍌燹顕幰攇蘚櫶"
        "譣玁韅顯灦见县苋岘限现线臽県陥"
        "宪姭娊峴陷莧哯涀垷埳現晛馅羡缐"
        "睍絤腺粯塪献羨僩僴誢綫線鋧撊憲"
        "橺橌錎餡縣豏壏麲臔瀗獻糮霰鼸咞"
        "衘鑦"},
    {"x", "xiang",
        "乡芗相香郷鄉鄊厢廂湘缃鄕葙萫薌"
        "箱緗膷襄麘忀骧欀瓖镶纕鑲驤瓨降"
        "佭详庠栙祥絴翔詳跭享亯响饷蚃晑"
        "飨想銄餉鲞鮝蠁鯗響饗饟鱶向姠"
        "巷项珦象項缿衖勨像嶑橡曏襐蟓嚮"
        "鐌鱌"},
    {"x", "xiao",
        "灱灲肖枭呺哓削侾骁枵绡庨烋宵宯"
        "逍消鸮虓婋猇萧梟焇销痚痟翛硝硣"
        "窙蛸綃揱箫嘐潇踃歊銷霄獢撨嘵憢"
        "膮蕭彇颵魈鴞鴵簘蟏蟂藃穘嚣瀟蟰"
        "簫髇櫹囂嚻髐鷍驍蠨毊虈洨郩崤淆"
        "訤殽誵小晓暁筱筿皛篠謏曉皢孝効"
        "恔咲哮涍俲笑校效啸傚敩詨誟嘨嘋"
        "嘯熽歗斆斅﨧"},
    {"x", "xing",
        "兴狌星垶骍猩惺煋瑆腥觪篂箵鮏興"
        "觲騂曐皨鯹刑邢饧行陉形侀郉陘荥"
        "洐型钘娙铏硎鈃蛵滎銒鉶鋞餳省睲"
        "醒擤杏性幸姓荇莕倖婞悻涬葕緈﨨"
        "嬹臖哘謃"},
    {"x", "xin",
        "忄心邤辛芯妡忻炘杺欣昕盺莘俽"
        "惞訢鈊锌歆新廞鋅噷嬜薪馨鑫馫枔"
        "镡襑鐔伈阠伩囟孞信軐訫脪衅焮馸"
        "顖舋釁"},
    {"x", "xie",
        "些娎猲揳楔歇蝎蠍叶邪劦协旪胁協"
        "奊垥恊峫挟拹挾脇脋脅衺斜谐偕絜"
        "翓綊瑎愶嗋携熁膎鲑鞋蝢緳缬撷擕"
        "縀勰諧燲嚡擷鞵襭攜孈讗龤写血冩"
        "寫藛伳灺绁泄泻祄缷洩炧炨契卸卨"
        "屑烲禼徢偰偞焎紲械絏絬亵谢屟媟"
        "渫塮僁解靾榭榍褉暬緤噧屧獬嶰澥"
        "懈廨邂薤薢糏韰謝褻燮夑瀉鞢齘繲"
        "蟹蠏瀣爕齛齥纈齂躞"},
    {"x", "xiong",
        "匂凶兄兇匈讻芎忷汹洶恟哅胸胷訩"
        "詾賯雄熊熋焸焽诇詗夐敻楿"},
    {"x", "xu",
        "吁圩戌盱疞砉欨胥须顼訏許裇虚虗"
        "偦谞媭揟湑欻虛須綇楈需魆墟嘘噓"
        "蕦嬃歔縃緰蝑諝歘燸譃魖繻驉鬚鑐"
        "俆徐冔禑蒣许诩呴姁浒栩珝喣暊詡"
        "稰鄦糈諿醑盨旭旴伵芧序汿侐卹怴"
        "沀恤昫叙洫晇殈烅珬垿欰畜酗烼绪"
        "续敍敘勖勗溆婿壻聓訹絮朂続賉頊"
        "滀蓄慉煦槒漵潊銊聟緒盢瞁稸魣緖"
        "獝藇藚續鱮﨏蓿"},
    {"x", "xiu",
        "休俢修庥咻脩烌羞脙鸺臹貅馐髤銝"
        "樇髹鵂鎀鏅饈鱃飍苬朽宿滫潃糔秀"
        "岫峀绣珛袖臭琇锈綉溴嗅璓褏褎銹"
        "螑繍嚊繡鏥鏽齅鮴"},
    {"x", "xue",
        "削疶蒆靴薛辥辪鞾穴斈乴茓峃学泶"
        "鸴袕踅學嶨壆噱燢澩觷鷽彐雪鳕鱈"
        "吷狘岤坹桖谑趐謔瞲瀥樰膤轌"},
    {"x", "xuan",
        "吅轩昍宣弲晅軒梋谖萱萲喧媗揎塇"
        "愃愋煖煊蓒暄瑄睻蝖禤箮翧儇鋗鞙"
        "蕿嬛懁諠諼駽鍹翾蠉矎蘐藼譞玄县"
        "玹痃悬琁旋蜁嫙漩璇暶檈璿懸咺选"
        "烜選癣癬券泫怰炫昡绚眩铉袨琄眴"
        "衒渲絢楦楥鉉碹蔙镟颴縼繏鏇贙"},
    {"x", "xun",
        "坃勋荤埙焄勛塤熏窨勲勳薫薰壎獯"
        "曛臐燻蘍矄纁爋壦醺廵巡寻旬杊郇"
        "询畃荨荀浔洵峋恂紃珣栒桪毥偱循"
        "尋揗詢鲟鄩噚潭潯駨璕攳燖燅樳蟳"
        "鱏鱘灥卂讯训迅伨驯汛侚狥逊迿巺"
        "徇殉訊訓訙浚奞殾巽稄馴遜愻蕈噀"
        "顨鑂嚑"},

    {"y", "ya",
        "ㄚ丫圧吖压厌呀庘押枒鸦哑鸭桠孲"
        "铔雅椏鴉鴨錏壓鵶鐚牙伢芽岈厓玡"
        "琊蚜笌堐猚崖崕涯釾睚衙漄齖疋厊"
        "庌疨唖啞痖瘂蕥劜圠轧覀襾冴亚讶"
        "迓亜犽亞軋砑挜娅垭俹氩掗訝埡婭"
        "猰聐揠氬稏圔窫齾鯲鑓軈"},
    {"y", "yan",
        "咽恹烟殷珚胭焉淹淊阏阉崦湮腌硽"
        "煙歅鄢傿嫣漹嶖醃閹燕懨嬮篶懕臙"
        "黫讠延闫妍芫严阽言訁郔岩沿炎炏"
        "昖狿埏莚姸娫研铅盐娮阎啱琂硏訮"
        "閆蜒綖筵嵒嵓喦塩揅楌詽碞蔅颜虤"
        "閻厳檐顔顏簷壛巌嚴櫩巖巗壧鹽礹"
        "麣夵抁沇奄乵兖兗匽弇俨衍剡眼酓"
        "偃掩郾厣萒遃隒嵃揜渰渷扊棪愝晻"
        "琰罨裺椼演嵼褗蝘魇戭噞躽縯黡檿"
        "厴黤甗鶠鰋龑黭黬儼孍顩鼴鼹魘巘"
        "巚曮齴黶厌妟觃牪砚姲彦彥烻唁验"
        "宴艳晏覎偐谚隁焔焰焱堰喭雁敥猒"
        "硯椻鳫滟溎墕熖厭酽暥鴈谳嬊餍燄"
        "赝鬳諺鴳曕嚈酀騐験艶贋嚥嬿爓"
        "曣騴醶齞鷃贗灔囐鷰驗醼讌觾饜艷"
        "釅驠灎灧讞豓豔灩剦樮軅"},
    {"y", "yao",
        "幺夭吆约妖殀祅要訞喓葽楆腰鴁鴢"
        "徼邀爻尧尭肴侥荛姚峣轺垚烑陶倄"
        "珧窑铫堯揺傜谣軺滧徭遥遙嗂媱猺"
        "摇搖愮摿榣暚飖瑶瑤餆窯窰磘嶢嶤"
        "餚繇謡謠鎐鳐颻蘨邎顤鰩鱙仸宎岆"
        "抭杳枖狕苭咬柼眑窅窈舀偠婹崾溔"
        "蓔榚闄騕齩鷕疟穾药钥袎窔葯筄詏"
        "靿覞熎鹞獟鼼薬藥燿曜艞矅耀纅鷂"
        "讑"},
    {"y", "yang",
        "央姎抰泱殃胦秧眏鸯鉠雵鞅鴦鍈阳"
        "阦扬羊飏炀杨旸钖疡氜劷佯徉洋"
        "垟昜羏珜烊陽眻蛘揚崵崸煬楊敭瑒"
        "暘瘍輰諹鍚鴹颺鰑霷鸉卬仰佒咉岟"
        "坱炴柍养氧痒紻軮楧傟慃氱飬蝆養"
        "駚懩攁瀁癢怏恙样羕詇漾様樣礢"},
    {"y", "ye",
        "吔耶倻掖椰暍歋潱噎擨蠮邪爷捓揶"
        "铘爺瑘鋣鎁ㄝ也冶野埜嘢漜壄业叶"
        "曳页曵邺抴夜枼拽亱咽頁捙枽烨晔"
        "液谒葉腋殗業煠馌墷璍僷燁曅曄皣"
        "瞱擛鄴靥餣謁嶪嶫澲擫瞸曗鍱鎑饁"
        "擪礏爗鵺鐷靨驜鸈丆亪"},
    {"y", "yi",
        "一弌衤伊衣医吚壱依祎洢咿郼渏悘"
        "铱猗蛜壹揖椅禕漪稦銥嫛嬄撎夁噫"
        "瑿鹥繄檥檹醫毉黟譩鷖黳乁义匜仪"
        "夷圯宐诒冝杝沂沶侇迤宜狋怡饴拸"
        "姨恞贻峓迻荑瓵珆咦訑貤胰栘桋巸"
        "眙袘宧扅萓蛇痍移椬蛦貽詒羠遗媐"
        "颐飴頉誃跠椸暆疑熪遺儀彛彜嶬螔"
        "頤頥顊鴺鮧簃嶷寲彝彞謻鏔籎觺讉"
        "乙已以迆钇攺矣苡佁尾苢迱庡舣蚁"
        "釔笖酏扆逘倚偯旑崺鈘鉯鳦裿蛾旖"
        "踦輢螘敼嬟礒蟻艤顗轙齮乂亿弋刈"
        "艺忆艾阣仡议肊伇芅亦异忔屹抑坄"
        "呓劮役苅佚译耴杙邑枍炈易衪秇诣"
        "佾呹呭驿泆怿怈绎峄浂帟帠俋弈奕"
        "疫羿昳玴轶枻食栧欭袣益谊唈浥浳"
        "挹悒垼埸埶逸勚萟殹翊翌悥豙豛異"
        "訲訳隿釴羛鈠軼骮跇詍晹敡殔棭焲"
        "蛡鄓湙幆嗌溢缢兿義亄睪獈竩痬意"
        "詣肄裔裛駅榏瘗膉蜴蓺勩廙嫕潩億"
        "鹝鹢毅镒瘞槸熠熤熼篒誼黓艗燚曀"
        "殪瘱瞖穓螠褹縊劓薏澺嬑嶧墿圛懌"
        "憶寱翳翼臆斁歝曎燡燱檍賹貖鮨鎰"
        "贀镱癔藝藙繹繶豷霬鯣鶂鶃饐醷醳"
        "譯議蘙瀷囈鐿鷊鷁懿襼鷧驛鷾鸃虉"
        "齸讛辷匇凧弬夞畩鶍鶎"},
    {"y", "yin",
        "囙因阴阥侌茵骃姻洇垔音栶氤殷陰"
        "隂陻凐秵铟裀絪筃堙愔喑婣溵蔭蒑"
        "禋慇瘖銦鞇磤緸諲霒駰霠闉噾濦齗"
        "韾冘乑吟犾圻烎斦泿垠圁狺峾荶珢"
        "訚訔訡银淫寅婬崟崯鈝龂滛碒鄞蔩"
        "夤銀龈誾璌殥噖嚚蟫檭霪齦鷣廴引"
        "尹饮吲蚓隐赺鈏飲淾隠飮靷輑朄趛"
        "瘾檃隱嶾濥螾檼蘟櫽癮讔印茚荫洕"
        "胤垽堷湚猌廕窨酳癊慭憖憗鮣懚"
        "岃粌"},

    {"y", "ying",
        "应応英莺珱偀渶绬婴媖瑛煐朠锳碤"
        "嫈嘤缨撄甇緓蝧罂賏樱璎鹦噟霙罃"
        "褮鴬韺嬰膺應鹰甖鶑鶧罌譍孆嚶攖"
        "蘡孾瀴櫻瓔礯譻鶯鑍鷪蠳纓鷹鸎鸚"
        "迎盁茔荥荧盈莹萤营萦蛍営萾溁溋"
        "滢蓥塋楹僌颖熒蝇潆蝿禜瑩螢營嬴"
        "縈覮謍赢濙濚濴藀瀅蠅鎣巆攍瀛瀯"
        "瀠贏櫿灐籝灜籯郢矨浧梬颍颕摬影"
        "潁穎瘿頴鐛廮巊癭映暎硬媵膡鱦栍"
        "桜愥闏"},
    {"y", "yo", "育哟唷喲罀"},
    {"y", "yong",
        "佣拥邕痈庸傭嗈鄘雍嫞滽墉慵牅壅"
        "澭擁噰镛郺臃癕雝鳙鏞灉廱饔鷛鱅"
        "癰喁颙顒鰫永甬咏泳勇勈俑栐柡悀"
        "涌埇恿惥愑湧詠硧蛹塎嵱彮愹慂踊"
        "鲬踴鯒用苚蒏醟怺砽"},
    {"y", "you",
        "优忧攸怮呦泑幽峳浟逌悠麀羪滺憂"
        "鄾優瀀嚘懮櫌耰纋尢尤由甴沋邮犹"
        "油怞肬怣疣柚庮郵莜莸秞铀蚰訧偤"
        "逰遊猶游鱿鲉鈾楢猷輏駀魷蝤蝣蕕"
        "鮋輶繇友有酉丣卣苃羑莠栯梄铕"
        "聈湵蜏禉銪槱牖牗黝又右幼佑侑狖"
        "峟囿牰祐迶哊宥姷诱唀蚴亴釉貁酭"
        "誘褎鼬櫾孧"},
    {"y", "yue",
        "曰曱约約箹矱哕噦月乐戉刖妜岄抈"
        "礿玥泧岳说恱栎钥钺蚏蚎阅軏悦悅"
        "捳跃跀鈅越粤粵鉞閲閱篗樾嬳嶽龠"
        "籆蘥瀹黦躍爚禴籥鑰鸑籰鸙"},
    {"y", "yuan",
        "囦肙鸢剈冤鸳眢寃涴渊渁渆渕淵葾"
        "惌蒬棩鹓裷蜎箢鳶駌蜵鴛鵷嬽灁鼘"
        "鼝元円邧贠沅园芫员茒杬垣爰貟笎"
        "蚖袁圆原員厡媛猨援圎湲鼋缘鈨源"
        "溒園圓塬猿嫄媴蒝辕榞榬緣魭縁褤"
        "蝯蝝螈黿羱薗橼圜轅謜鎱櫞邍騵鶢"
        "鶰厵远盶逺遠鋺夗苑妴院怨衏垸傆"
        "掾禐瑗愿裫褑噮願"},
    {"y", "yu",
        "込迂迃吁扝扜纡於穻陓紆盓菸淤唹"
        "瘀箊与于亐予邘伃余妤扵杅欤玙玗"
        "盂衧臾鱼舁竽虶禺茰俞兪谀娱娛娯"
        "馀狳桙酑雩魚渔萸隅隃萮渝湡揄堣"
        "堬嵎嵛崳逾喁楰愉腴畬骬虞艅觎愚"
        "瑜歈榆楡牏舆窬睮褕漁蕍蝓歶雓餘"
        "諛羭踰覦嬩澞璵歟螸輿鍝謣髃鮽騟"
        "籅旟轝蘛鰅鷠鸆齵屿宇伛羽妪雨"
        "俣俁语挧禹圄祤圉敔匬鄅偊庾萭斞"
        "铻瘐楀與瑀傴寙語窳頨龉貐懙噳嶼"
        "斔穥麌齬肀驭玉聿芋芌圫饫汩忬谷"
        "欥育郁茟狱秗昱浴峪彧俼预钰砡粖"
        "袬谕逳菀尉阈淯淢惐悆欲域堉棫棛"
        "棜琙焴寓媀喻喅喩庽御遇馭飫粥鹆"
        "硲硢矞裕鈺誉罭預蓣蒮煜滪愈稢戫"
        "蔚僪隩嶎獄嫗緎蜮蜟毓瘉銉輍豫鋊"
        "鳿遹薁蓹熨潏稶慾澦燠燏蕷鴥鴪鴧"
        "錥諭閾礇禦鹬魊儥鵒礜癒醧篽饇櫲"
        "蘌霱譽鐭雤鬻驈欎鷸鱊籞鸒欝龥鬰"
        "鬱籲灪爩礖軉"},
    {"y", "yun",
        "晕蒀缊蒕煴氲氳熅奫蝹赟馧贇匀勻"
        "云伝芸员妘沄纭囩昀秐眃畇郧涢耺"
        "耘紜雲鄖蒷溳愪筠筼熉澐蕓鋆篔縜"
        "橒允阭狁抎夽陨荺殒隕喗鈗馻殞磒"
        "賱霣齫齳孕运郓枟恽酝鄆傊運愠惲"
        "慍暈韫腪韵褞熨蕴薀縕醖醞餫韞韗"
        "藴蘊韻抣"},
    {"z", "za",
        "帀扎匝沞咂拶桚鉔魳臜臢杂沯砸韴"
        "雑襍雜囃囋雥咋乽橴"},
    {"z", "zan",
        "兂糌橵篸簪簮鵤鐟鐕咱偺喒拶昝寁"
        "揝撍噆儧攅攒儹攢趱趲暂暫賛赞錾"
        "鄼酂濽蹔鏨贊瓉瓒酇囋灒讃瓚禶襸"
        "讚饡"},
    {"z", "zao",
        "傮遭糟醩蹧凿鑿早枣蚤棗澡璪薻藻"
        "灶皂皁造唣唕梍慥煰喿艁簉噪燥竃"
        "竈譟趮躁栆"},
    {"z", "zang",
        "匨赃牂脏羘賍賘臧贓髒贜驵駔奘弉"
        "塟葬蔵銺藏臓臟欌"},
    {"z", "zai",
        "灾災甾哉烖栽渽溨睵賳仔宰载崽再"
        "扗在洅傤載酨儎縡岾"},
    {"z", "ze",
        "则沢泽泎责迮咋择則帻啧啫舴笮責"
        "矠滜溭箦嘖嫧幘蔶赜樍歵諎擇瞔皟"
        "簀賾礋襗謮蠌齚齰鸅仄庂汄昃昗侧"
        "捑崱択硳"},
    {"z", "zeng",
        "曽曾増鄫缯增憎橧璔磳矰罾繒譄综"
        "锃鋥赠熷甑鬵贈囎"},
    {"z", "zen", "怎谮譖"}, {"z", "zei", "贼戝賊鲗蠈鰂鱡"},
    {"z", "zha",
        "扎吒咋抯挓查柤奓紥哳偧紮渣溠喳"
        "猹揸楂劄摣皶觰樝皻譇齄齇轧札闸"
        "炸铡蚻喋牐閘箚耫鍘譗厏苲拃眨砟"
        "鲊鲝鮓鮺乍诈灹咤栅柞痄宱蚱詐搾"
        "槎榨蜡霅醡蓙"},
    {"z", "zhai",
        "侧夈捚斋斎摘榸齋宅择翟檡窄鉙责"
        "柴债砦祭債寨粂瘵"},
    {"z", "zhan",
        "占沾枬毡旃栴蛅粘飦趈詀惉詹閚谵"
        "薝邅噡嶦霑氊氈瞻鹯旜譫饘鳣魙驙"
        "鸇鱣讝斩飐盏展崭斬琖盞搌辗嶄嶃"
        "榐颭醆嫸橏輾黵佔战栈桟站绽偡菚"
        "湛棧戦綻輚嶘戰虥虦襢覱轏譧驏蘸"},
    {"z", "zhao",
        "佋钊妱招巶昭釗着啁朝鉊鼌駋嘲鍣"
        "皽爫爪找沼瑵召兆诏枛炤狣垗赵笊"
        "肁棹旐詔罩照肇肈箌趙曌燳鮡瞾櫂"
        "羄罀"},
    {"z", "zhang",
        "仉张張章鄣傽蔁遧粻嫜獐彰漳慞樟"
        "暲璋餦蟑騿麞鱆长涨掌漲礃丈仗扙"
        "帐杖胀账涱帳脹障痮幛嶂墇賬瘴瘬"
        "瞕粀幥鏱"},
    {"z", "zhe",
        "折蜇遮嗻嫬螫厇歽矺砓虴籷袩埑哲"
        "啠辄晢晣悊喆詟蛰谪摺輒輙銸磔辙"
        "蟄鮿謫謺嚞轍讁讋者锗褚赭踷鍺褶"
        "襵这柘這浙淛蔗樜鹧蟅鷓粍"},
    {"z", "zhei", "这"},
    {"z", "zhong",
        "中伀汷彸刣忪妐炂忠泈终钟柊盅衳"
        "舯衷終鈡蜙锺幒蔠銿鴤螤螽鍾鼨蹱"
        "鐘籦肿种冢喠尰煄腫歱塚種瘇徸踵"
        "众仲妕狆祌衶重茽蚛眾偅堹媑筗衆"
        "諥"},
    {"z", "zheng",
        "丁正争佂诤征姃怔爭糽埩炡政挣狰"
        "峥烝脀钲眐症聇睁铮掙崝崢猙揁媜"
        "筝踭鉦睜徰蒸錚箏篜鲭鬇癥鏳氶抍"
        "拯掟晸愸撜整证郑証幁塣諍靕鄭"
        "鴊證"},
    {"z", "zhi",
        "之氏支只卮汁芝汦汥吱巵知肢泜织"
        "枝栀祗胝胑秓衼疷隻脂祬栺倁梔椥"
        "臸綕禔稙搘馶蜘榰憄鳷鴲織鼅蘵执"
        "侄妷直姪值値聀釞职淔埴執殖戠植"
        "犆禃跖絷瓡馽摭潪嬂漐慹踯膱樴縶"
        "蹢蹠職蟙軄躑夂止阯劧旨帋芷扺沚"
        "纸址坁坧抧茋祉秖恉轵枳砋衹咫指"
        "洔淽茝紙疻訨趾黹軹酯徴墌徵藢襧"
        "芖至豸扻伿识忮志炙质治垁郅迣厔"
        "制帜帙挃庢庤陟峙洷栉柣祑挚桎晊"
        "歭秩贽轾徏娡狾致袟紩畤窒痔痓铚"
        "鸷貭翐觗袠猘徝掷乿剬偫秷梽智滞"
        "崻傂骘痣彘蛭置锧跱輊筫雉寘搱廌"
        "滍稚滯墆銍製覟誌瘈疐觯踬質鋕熫"
        "稺膣摯摨幟擳隲璏旘瀄鴙駤緻螲懥"
        "櫛穉儨劕擿擲懫贄觶騭鯯櫍瓆豑礩"
        "騺驇鷙躓鑕豒俧潌"},
    {"z", "zhou",
        "州舟诌侜周洲诪炿烐珘调郮辀婤淍"
        "啁週徟鸼矪粥喌赒輈銂輖賙霌鵃謅"
        "盩嚋騆譸妯轴軸肘疛帚菷晭睭箒鯞"
        "纣伷咒呪绉宙冑祝昼咮荮紂胄"
        "皱酎粙舳晝葤詋甃僽駎皺縐噣"
        "骤繇籀籕籒驟碡駲"},
    {"z", "zhua", "抓挝撾檛膼簻髽爪"},
    {"z", "zhu",
        "朱邾侏诛茱洙诸珠株猪秼铢硃袾蛛"
        "絑誅跦銖槠蝫潴蕏橥諸豬駯鴸鮢鼄"
        "藸瀦鯺櫫櫧蠩术竹竺笁柚茿炢烛"
        "逐窋笜逫蓫瘃篴燭蠋躅鱁劚孎灟爥"
        "斸欘曯蠾钃丶主劯宔拄柱罜陼帾渚"
        "煮煑属詝褚濐嘱燝麈瞩囑鸀矚宁伫"
        "住佇芧苎助纻坾贮驻迬杼拀注祝柷"
        "炷殶壴莇祩竚眝疰砫蛀紵紸著庶羜"
        "铸筑貯軴註跓嵀鉒筯飳馵箸翥樦鋳"
        "駐麆築篫簗鑄墸"},
    {"z", "zhen",
        "贞针侦帧浈胗珍珎貞針祯桢真眞砧"
        "帪偵酙葴幀寊湞遉斟溱嫃獉搸蓁蒖"
        "甄椹楨禎鉁禛瑧榛碪殝潧箴臻樼澵"
        "薽錱轃鍼籈鱵诊枕抮轸昣弫姫屒眕"
        "疹畛袗聄紾裖軫覙診缜駗稹縝縥辴"
        "鬒黰阵圳纼甽鸩陣侲挋振栚朕紖眹"
        "赈塦揕絼賑誫镇震鴆鎭鎮鋴"},
    {"z", "zhuai", "拽转跩"},
    {"z", "zhui",
        "隹追骓椎锥錐騅鵻沝坠笍娷缀缒甀"
        "腏惴畷膇硾墜綴赘縋諈醊錣礈贅鑆"},
    {"z", "zhuang",
        "庄妆妝庒荘莊娤桩梉粧装湷裝樁糚"
        "奘壮壯状狀壵焋僮幢撞戆"},
    {"z", "zhuan",
        "专叀専砖專鄟嫥塼甎瑼膞磗颛磚諯"
        "顓蟤鱄转孨竱轉传沌灷啭転堟蒃瑑腞"
        "赚僎馔撰篆篹襈縳賺譔饌籑囀"},
    {"z", "zhun", "屯迍宒肫窀谆啍諄衠准埻凖準綧訰稕"},
    {"z", "zhuo",
        "拙炪捉倬桌棁梲涿棳焯槕穛擢鐯穱"
        "彴犳汋圴灼妰卓叕茁浊斫烵浞诼丵酌"
        "娺啄啅着椓晫斮斱琢琸硺罬窡禚斲撯"
        "擆劅諑諁鋜篧缴濁濯斵斀謶镯櫡鵫躅"
        "蠗灂鐲鷟籗蠿籱窧"},
    {"z", "zou",
        "邹驺陬郰诹菆掫棷棸鄒緅箃諏鲰鄹黀"
        "鯫騶齱齺赱走奏揍"},
    {"z", "zong",
        "宗枞倧骔综堫惾腙葼猣嵏嵕棕椶朡稯"
        "嵸潈綜緃翪踪踨緵熧蝬磫繌鍐鬃騌蹤"
        "騣鯮鬉鬷鯼鑁总倊偬捴揔搃惣焧傯蓗"
        "摠総縂緫燪總纵昮疭猔碂粽糉瘲縦縱"
        "豵糭"},
    {"z", "zi",
        "仔孖孜吱甾茊茲兹姿姕咨赀资玆栥紎"
        "赼缁秶崰淄谘菑葘鄑滋湽嵫椔粢辎嗞"
        "孳孶锱禌趑觜訾資貲緇緕龇鈭稵镃輜"
        "鼒鲻髭輺錙諮趦澬鍿鎡頾頿齍鶅鯔鰦"
        "纃齜蓻子吇杍姊姉胏秄矷虸耔籽秭呰"
        "茈笫釨梓啙紫滓訿榟字芓自荢茡剚倳"
        "牸恣眦眥渍胾胔漬嗭魸鯑"},
    {"z", "zu",
        "苴租菹葅蒩卆足卒哫崒崪族椊箤踤"
        "镞鏃阻诅组祖珇爼俎唨組詛靻鼡乼"},
    {"z", "zun", "尊嶟遵樽罇繜鐏鳟鷷鱒僔噂撙譐捘銌"},
    {"z", "zui",
        "咀厜脧嗺樶蟕纗觜嶊嘴噿璻栬冣絊酔"
        "晬祽最稡罪辠酻槜醉蕞嶵鋷錊檇檌"},
    {"z", "zuan", "钻鉆劗鑚躜躦鑽篹繤缵纂纉纘籫赚攥"},
    {"z", "zuo",
        "作嘬穝昨莋秨笮捽琢筰鈼稓左佐撮繓"
        "阼坐怍岞岝侳祚胙袏座唑做葃葄飵糳"
        "咗"}
};

CharacterTransliterate::CharacterTransliterate(void)
{
}

CharacterTransliterate::~CharacterTransliterate()
{
}

bool CharacterTransliterate::IsChineseCharacter(wchar_t chineseCharacter)
{
    return (uint16_t)chineseCharacter >= 0x4E00 && (uint16_t)chineseCharacter <= 0x9FCF;
}

Container CharacterTransliterate::GetContainer(std::wstring wChinese)
{
    Container container;
    size_t count = wChinese.size();
    std::vector<std::vector<std::wstring>> initialsVectors;
    std::vector<std::vector<std::wstring>> nameFullFightsVectors;
    for (size_t index = 0; index < count; index++) {
        std::vector<std::wstring> initials;
        std::vector<std::wstring> nameFullFights;
        std::wstring childwChineseCharacter = wChinese.substr(index, 1);
        GetCommonPronunciation(childwChineseCharacter, initials, nameFullFights);
        if (!initials.empty() && !nameFullFights.empty()) {
            initialsVectors.push_back(initials);
            nameFullFightsVectors.push_back(nameFullFights);
        }
    }
    HILOG_INFO("CharacterTransliterate GetContainer length:%{public}zu", nameFullFightsVectors.size());
    container.initialsContainer_ = initialsVectors;
    container.nameFullFightContainer_ = nameFullFightsVectors;
    return container;
}

void CharacterTransliterate::GetCommonPronunciation(
    std::wstring &chineseCharacter, std::vector<std::wstring> &initials, std::vector<std::wstring> &nameFullFights)
{
    // Only one character can be entered
    if (chineseCharacter.size() > 1) {
        return;
    }
    initials.clear();
    nameFullFights.clear();
    std::string chineseCharacterString = WstringToString(chineseCharacter);
    // If it is a Chinese character, there is no need to transcode Unicode here.
    // The system will transcode it. Only the Chinese character needs to be matched directly.
    if (IsChineseCharacter(chineseCharacter[0])) {
        int len = 411;
        for (int index = 0; index < len; index++) {
            std::string::size_type find =
                CharacterTransliterate::chineseTable_[index].chineseCharacters_.find(chineseCharacterString);
            if (find != std::string::npos) {
                initials.push_back(StringToWstring(CharacterTransliterate::chineseTable_[index].initials));
                nameFullFights.push_back(StringToWstring(CharacterTransliterate::chineseTable_[index].nameFullFight_));
            }
        }
    } else {
        initials.push_back(chineseCharacter);
        nameFullFights.push_back(chineseCharacter);
    }
}

// sort Chinese Pinyin combinations
std::vector<std::vector<std::wstring>> CharacterTransliterate::GetCombinedVector(
    std::vector<std::vector<std::wstring>> sourceVector)
{
    // gets the first set of attributes in the sourcevector collection
    std::vector<std::vector<std::wstring>> targetVector;
    targetVector.push_back(sourceVector[0]);
    // start the traversal from the second set of attributes in the sourcevector collection
    unsigned int size = sourceVector.size();
    for (unsigned int i = 1; i < size; i++) {
        std::vector<std::wstring> nextVector = sourceVector[i];
        // traverse the combination of the second set of attributes and the first set of attributes
        // set an intermediate array to store the data after attribute combination
        std::vector<std::vector<std::wstring>> tempVector;
        for (std::wstring nextStr : nextVector) {
            for (std::vector<std::wstring> targetStrVector : targetVector) {
                for (std::wstring targetStr : targetStrVector) {
                    // put the combined attributes into a temporary array
                    std::wstring tempString = targetStr + nextStr;
                    std::vector<std::wstring> temp;
                    temp.push_back(tempString);
                    tempVector.push_back(temp);
                }
            }
        }
        targetVector = tempVector;
    }
    return targetVector;
}

// Split Chinese Pinyin with '|'
std::wstring CharacterTransliterate::Join(std::vector<std::vector<std::wstring>> strVector, std::wstring split)
{
    std::wstring str;
    for (std::vector<std::wstring> childVector : strVector) {
        size_t len = childVector.size();
        for (size_t i = 0; i < len; i++) {
            str.append(childVector[i]);
            if (i < len - 1) {
                str.append(split);
            }
        }
    }
    return str;
}

std::string CharacterTransliterate::WstringToString(std::wstring wstr)
{
    using convert_typeX = std::codecvt_utf8<wchar_t>;
    std::wstring_convert<convert_typeX, wchar_t> converterX;
    return converterX.to_bytes(wstr);
}

// convert string to wsstring
std::wstring CharacterTransliterate::StringToWstring(std::string str)
{
    using convert_typeX = std::codecvt_utf8<wchar_t>;
    std::wstring_convert<convert_typeX, wchar_t> converterX;
    return converterX.from_bytes(str);
}
} // namespace Contacts
} // namespace OHOS
